[
  {
    "title": "3rd National Space Conference NSC 2025",
    "description": "3rd South African National Space Conference NSC 2025\nThe third National Space Conference (NSC) is scheduled to be held at the CSIR International Convention Centre in Tshwane, South Africa, from 20 – 22 August 2025. The NSC is organised by the National Earth Observations and Space Secretariat (NEOSS) and the South African National Space Agency (SANSA) on behalf of the Department of Science, Technology and Innovation (DSTI), in collaboration with key national partners including the South African Air Force (SAAF).  \nThe NSC serves as a dynamic platform for national stakeholders from diverse backgrounds to convene, exchange ideas, and catalyse discussions on critical space science and innovation challenges. \nThe NSC also gives South African stakeholders (such as researchers, academics, public servants, business, data suppliers, consultants, and NGOs) a forum and opportunity to interact, share ideas and information, and spark discussions about how to work together most effectively to create a sustainable space ecosystem, programs, and initiatives for national growth and development. \nWhy should you attend?\nThe NSC will feature a compelling agenda including keynote addresses, panel discussions, technical sessions, and a vibrant space science and technology exhibition. Presentations will span scientific, policy, and technical realms, encouraging interdisciplinary dialogue and collaboration to address pressing global challenges. \nMoreover, the NSC offers unparalleled networking opportunities and platforms for showcasing groundbreaking innovations. Special events tailored for youth participation underscore the conference’s commitment to promoting equality, diversity, inclusion, and access (EDIA) within the space science community. \nMore information can be accessed at www.spaceconference.co.za \nFor any inquiries, please contact the organising team at info@spaceconference.co.za \n\n\nEvent start date\nWednesday, August 20, 2025\n\n\n\nEvent end date\nFriday, August 22, 2025\n\n\n\nType of event\nin person\n\n\n\nWebsite Link\nwww.spaceconference.co.za",
    "start": "2025-08-20T00:00:00+00:00",
    "end": "2025-08-23T00:00:00+00:00",
    "url": "http://www.spaceconference.co.za",
    "location": "CSIR International Convention Centre, Meiring Naude Road, Brummeria, Pretoria, Gauteng, South Africa",
    "organizer": "CSIR Council for Scientific and Industrial Research",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-18 15:19:35+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-18 15:19:35+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/National-Space-Conference-NSC-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Wednesday",
    "iso_week": 34,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Conference, Exhibition",
    "timestamp_epoch": 1755648000
  },
  {
    "title": "GEOPAQ 2025",
    "description": "GEOPAQ 2025 Conference: Bioinspired Frontiers in Space and Biomimicry\nEvent Overview\nGEOPAQ 2025 is a new cutting-edge conference dedicated to exploring the intersection of space exploration and biomimicry. This event brings together scientists, engineers, researchers, and industry leaders to discuss innovative solutions inspired by nature to address challenges in space exploration and sustainability. With a focus on bioinspired technologies, attendees will delve into advancements that could revolutionize spacecraft design, habitat construction, resource utilization, and planetary protection. \nWho Should Attend GEOPAQ?\nGEOPAQ 2025 is ideal for: \n\nSpace Industry Professionals: Engineers, scientists, and innovators working on spacecraft systems, planetary exploration, and sustainable technologies.\nBiomimicry Experts: Researchers specializing in bioinspired designs applicable to aerospace and environmental challenges.\nAcademics and Students: Those studying aerospace engineering, biology, or environmental sciences interested in interdisciplinary collaboration.\nPolicy Makers and Investors: Decision-makers shaping the future of space exploration and sustainable practices.\nTechnology Enthusiasts: Anyone eager to learn about groundbreaking innovations at the nexus of biology and space science.\n\nWhy Attend?\n\nDiscover Innovations: Gain insights into how biomimicry is driving advancements in aerospace technology.\nNetwork with Leaders: Connect with top minds from academia, industry, and government agencies.\nShape the Future: Be part of discussions that influence sustainable space exploration strategies.\nCollaborative Opportunities: Explore partnerships for research, funding, or technology development.\n\nJoin GEOPAQ 2025 to explore how nature-inspired solutions are transforming the future of space exploration!",
    "start": "2025-08-20T00:00:00+00:00",
    "end": "2025-08-23T00:00:00+00:00",
    "url": "https://geopaq.com/",
    "location": "Cubex Centre Prague, Na Strži 2097/63, Prague, 140 00, Czech Republic",
    "organizer": "GEOPAQ",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-04-15 10:04:45+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-04-15 10:05:51+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/04/GEOPAQ-2025.jpg",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Networking Event"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Wednesday",
    "iso_week": 34,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Conference, Networking Event",
    "timestamp_epoch": 1755648000
  },
  {
    "title": "Binary Stars in a New Era",
    "description": "Binary Stars in a New Era Conference 2025\nThis conference, organised by the Yunnan Observatories (CAS), will be held from 24 to 30 August 2025 in Lijiang, Yunnan Province, China \nBinary stars lie at the heart of many key astrophysical phenomena. Various explosive cosmic events result from binary stars, as do close double black holes/neutron stars/white dwarfs, type Ia supernovae, X-ray binaries, millisecond pulsars etc. Relying on existing large scientific facilities, classical optical, radio and X-ray observations are discovering increasingly large numbers of such binary stars. A decade ago, the ground-based LIGO/Virgo detected the merging of two stellar-mass binary black holes, opening a new window in gravitational wave astronomy. In the future, with the support of next-generation astronomical instruments, we shall discover many more binary-related celestial objects. Against this backdrop, we convene this conference, inviting all international observers and theoreticians in the field of stellar science to participate in and exchange recent progress related to binary stars and to look forward to future collaboration and development of new directions for research. \nConference topics:\n\nBinary star interactions: from mass transfer to common envelope evolution.\nSupernovae: from progenitor modeling to explosion simulation.\nGravitational wave sources: from double black holes to white dwarfs.\nExotic stars: X-ray binaries, binary pulsars, luminous red novae, hot subdwarfs, cataclysmic variables, symbiotic stars, etc.\nBinary population synthesis studies on binary objects.\nBinary star observations from large facilities: Gaia, TESS, LAMOST, JWST, FAST, etc.\n\nExplore the Wonders of Lijiang and Beyond\nAs we eagerly await your arrival for the conference of “Binary Stars in a New Era”, it is our great pleasure to extend a heartfelt invitation for you to discover the beautiful city of Lijiang. It is also a historic city with rich cultural heritages and natural landscapes waiting fou you to explore. Whether you are passionate about history, enamored with natural splendors, or seeking distinctive cultural experiences, Lijiang offers a diverse tapestry of treasures that promises to enrich and delight every esteemed visitor.",
    "start": "2025-08-24T00:00:00+00:00",
    "end": "2025-08-31T00:00:00+00:00",
    "url": "https://binarystars2025.casconf.cn/",
    "location": "Lijiang, Lijiang, Yunnan, China",
    "organizer": "Yunnan Observatories, CAS",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-15 12:59:58+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-15 13:01:11+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/Binary-Stars-in-a-New-Era.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Sunday",
    "iso_week": 34,
    "all_day": true,
    "duration_hours": 168.0,
    "category_string": "Conference",
    "timestamp_epoch": 1755993600
  },
  {
    "title": "Andøya Satellite Summit 2025",
    "description": "The inaugural Andøya Satellite Summit 2025 is a premier gathering of satellite industry leaders, strategists, and experts set against the stunning backdrop of Andøya, home to Europe’s new orbital spaceport. This exclusive summit offers a unique opportunity to engage in forward-thinking discussions, explore business collaborations, and experience Norway’s cutting-edge space technology. \n🔹 Key Highlights: \n\nInsightful Discussions – Engage with top industry voices on emerging trends and innovations in satellite technology\n Networking & Social Events – Build valuable relationships with key decision-makers in the global space sector\n Nature & Business Integration – Discover new business opportunities in a breathtaking Arctic environment\n Exclusive Andøya Spaceport Tour – Get a behind-the-scenes look at Europe’s newest orbital launch site",
    "start": "2025-08-25T00:00:00+00:00",
    "end": "2025-08-29T00:00:00+00:00",
    "url": "https://www.spaceport-norway.no/2025/spaceport-norway-andoya-satellite-summit-2025",
    "location": "Andøya, Norway, Andøya, Norway",
    "organizer": "Spaceport Norway",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-03-11 07:13:18+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-03-11 07:13:18+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/03/673798043155cfae6d6409b4_673793651c9634da90dee7c7_Announcment.png",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Monday",
    "iso_week": 35,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "Conference",
    "timestamp_epoch": 1756080000
  },
  {
    "title": "32nd SEAC Conference",
    "description": "Timekeeping, Navigation, Surveying – Cultural Astronomy and Instruments\nThe 32nd SEAC Conference, titled “Timekeeping, Navigation, Surveying – Cultural Astronomy and Instruments,” will take place from August 25 to 30, 2025, in Hamburg, Germany. This event will bring together researchers, scholars, and enthusiasts from around the world. They will explore how astronomy, culture, and instruments intersect in various contexts. The conference will examine historical and modern methods of timekeeping, navigation, and land surveying. These practices have played key roles in shaping societies and their understanding of the cosmos. \nParticipants can look forward to engaging discussions and hands-on workshops. The event will also provide opportunities for networking and collaboration. By combining academic presentations with practical sessions, the conference will enhance the study of cultural astronomy and its tools. \nAbout SEAC\nThe European Society for Astronomy in Culture (SEAC) is a professional association dedicated to exploring the cultural dimensions of astronomy and related fields. Since its founding in Strasbourg, France, in 1992 under the guidance of Professor Carlos Jaschek, SEAC has grown to include around 90 members from 25 countries. While its core membership comprises European scientists, researchers from all continents actively contribute to its interdisciplinary approach. SEAC focuses on areas such as archaeoastronomy, anthropology, ethnoastronomy, the history of astronomy, mythology, spatial archaeology, and cosmology. It was the first professional organization of archaeoastronomers, playing a pivotal role in inspiring similar societies, such as ISAAC in the United States and SIAC in Latin America. \nThrough annual meetings and the publication of proceedings, SEAC fosters scientific exchange and collaboration. Its mission is to promote the study of astronomical practices within their cultural and environmental contexts, highlighting their importance in understanding human societies.",
    "start": "2025-08-25T00:00:00+00:00",
    "end": "2025-08-31T00:00:00+00:00",
    "url": "https://seactest.archeoastronomy.org/content/conferences/next-conference.html",
    "location": "TBA/Hamburg, Hamburg, Germany",
    "organizer": "The European Society for Astronomy in Culture (SEAC)",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-08 14:57:59+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-11 11:15:06+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/images.png",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Monday",
    "iso_week": 35,
    "all_day": true,
    "duration_hours": 144.0,
    "category_string": "Conference",
    "timestamp_epoch": 1756080000
  },
  {
    "title": "Space Industry & Government Summit & Expo",
    "description": "Welcome to Space Industry & Government Summit & Expo 2025\nWelcome to the International Space Industry and Government Summit & Expo, where the future of space exploration and innovation take center stage. This premier event brings together leaders from governments, private industry, and international organizations to shape the trajectory of the global space industry. With a focus on commercial space ventures, national security, advanced manufacturing, and government and private sector funding, the Summit offers cutting-edge discussions, breakthrough technological showcases, and strategic networking opportunities. Join us to explore pioneering space missions, advances in satellite technology, and solutions for space policy challenges. Contribute to this transformative journey as we unlock the secrets of the cosmos and forge a future where space is secure and beneficial for all. \nThe summit takes place at the Gaylord National Hotel & Convention Center in National Harbor, MD, USA, from 27 to 29 August 2025 \nFocus Areas\n\nCommand, Control, Cyber Operations\nIn-Space Manufacturing\nPositioning, Navigation, Timing\nRobotics, Automation\nSatellite Communications\nSpace Access, Mobility, Logistics\nSpace-Based Earth Observation\nSpace Defense, Security\nSpace Domain Awareness\nSurveillance, Reconnaissance, Tracking\nMOSA for Space Systems\n\nExhibit at the Summit & Expo\nShowcase your cutting-edge innovation at the Space Industry and Government Summit and Expo, a premier event bringing together leading stakeholders across the space ecosystem. This is a unique opportunity to present your solution to an audience of key decision-makers from government, corporate, and investment sectors. Engage directly with potential partners, clients, and investors, gain valuable feedback, and expand your network within the space industry. Exhibitors will benefit from enhanced visibility, strategic connections, and the chance to drive future partnerships. Don’t miss this chance to position your innovation at the forefront of space exploration, technology, and commercialization.",
    "start": "2025-08-27T00:00:00+00:00",
    "end": "2025-08-30T00:00:00+00:00",
    "url": "https://events.techconnect.org/SPACE_2025/",
    "location": "Gaylord National Resort & Convention Center, 201 Waterfront Street, National Harbor, MD, 20745, United States",
    "organizer": "TechConnect",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-19 15:12:55+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-19 15:12:55+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/Space-Industry-Government-Summit-Expo-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Wednesday",
    "iso_week": 35,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Conference, Exhibition",
    "timestamp_epoch": 1756252800
  },
  {
    "title": "European Rover Challenge ERC 2025",
    "description": "European Rover Challenge ERC 2025\nERC 2025 Date: 29-31 August 2025\nLocation: AGH University of Science and Technology, Krakow, Poland\nWebsite: www.roverchallenge.eu \nWelcome to ERC 2025\nThe European Rover Challenge (ERC) is Europe’s premier robotics and space exploration competition, uniting engineering enthusiasts, scientists, and space industry leaders from around the globe. The 2025 edition will take place at the prestigious AGH University of Science and Technology in Krakow, Poland, from 29 to 31 August. Over three days, teams will showcase their innovative rover designs while engaging in rigorous challenges modeled on real Mars mission tasks. Visitors can expect a blend of education, innovation, and entertainment, making ERC 2025 a must-attend event for space enthusiasts and professionals alike. \nEvent Highlights\n1. Robotics Competition\nThe heart of ERC 2025 is its robotics competition, where university teams from across the world will test their Mars rovers in various tasks designed to mimic extraterrestrial exploration scenarios. These challenges will assess: \n\nNavigation: Maneuvering through diverse terrains and obstacles.\nScientific Tasks: Collecting and analyzing soil samples.\nMaintenance Operations: Interacting with simulated infrastructure.\nAutonomous Functionality: Performing tasks independently with minimal human intervention.\n\nEach task pushes teams to the limits of their technical and problem-solving skills, fostering innovation in robotics and space exploration technologies. \n2. Keynote Talks and Panels\nERC 2025 will feature an inspiring lineup of speakers, including astronauts, leading scientists, and industry pioneers. These sessions will explore the latest advancements in robotics, artificial intelligence, and space exploration. Topics include: \n\nThe future of Mars exploration.\nIntegration of AI in space missions.\nOpportunities for collaboration between academia and industry.\n\nAttendees will gain valuable insights into current trends and future possibilities in the space sector. \n3. STEM Education Zone\nAimed at younger audiences and families, the STEM Education Zone offers interactive workshops, demonstrations, and exhibits. Highlights include: \n\nHands-on activities in coding and robotics.\nVirtual reality experiences simulating Martian landscapes.\nExhibits showcasing cutting-edge space technologies.\n\nThis zone is designed to inspire the next generation of scientists and engineers while providing an engaging experience for all visitors. \n4. Exhibitor Pavilion\nThe Exhibitor Pavilion will host industry leaders, startups, and research institutions showcasing their latest products and technologies. Attendees will have the opportunity to: \n\n\n\nExplore innovative space exploration tools.\nNetwork with industry professionals.\nLearn about career opportunities in the space sector.\n\n\n\nWhy Attend ERC 2025?\nERC 2025 offers a unique opportunity to witness the forefront of space exploration innovation and robotics. Whether you’re a professional in the space industry, a student passionate about science and technology, or a curious visitor, this event provides: \n\n\n\n\n\nInspiration: Discover groundbreaking technologies and ideas.\nEducation: Learn from world-class experts.\nNetworking: Connect with a global community of space enthusiasts and professionals.\n\n\n\n\n\nVenue and Accessibility\nThe AGH University of Science and Technology, located in the vibrant city of Krakow, provides a state-of-the-art venue for ERC 2025. Krakow’s rich cultural heritage, combined with its accessibility and hospitality, makes it an ideal destination for international visitors. The university campus is easily reachable by public transportation and offers modern facilities to ensure a seamless event experience. \nMark your calendars for 29-31 August 2025 and join us at ERC 2025 for an unforgettable celebration of innovation and exploration!",
    "start": "2025-08-29T00:00:00+00:00",
    "end": "2025-09-01T00:00:00+00:00",
    "url": "https://roverchallenge.eu/",
    "location": "AGH University of Krakow, al. Adama Mickiewicza 30, Kraków, 30-059, Poland",
    "organizer": "European Space Foundation",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-25 15:23:03+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-25 15:23:03+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/European-Rover-Challenge-ERC-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Competition",
      "Conference",
      "Exhibition",
      "Public event"
    ],
    "year": 2025,
    "month_name": "August",
    "day_of_week": "Friday",
    "iso_week": 35,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Competition, Conference, Exhibition, Public event",
    "timestamp_epoch": 1756425600
  },
  {
    "title": "57th Division For Planetary Sciences Annual Meeting",
    "description": "Annual Meeting of the American Astronomical Society (AAS) Division for Planetary Sciences (DPS), held at Finlandia Hall in Helsinki, Finland, 7-13 September 2025",
    "start": "2025-09-07T00:00:00+00:00",
    "end": "2025-09-14T00:00:00+00:00",
    "url": "https://dps.aas.org/meetings/future",
    "location": "Finlandia Hall, Mannerheimintie 15 A, Helsinki, 00260, Finland",
    "organizer": "American Astronomical Society (AAS)",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-07-01 19:56:13+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-16 11:12:11+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/07/AAS-DPS-2025.jpg",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Meeting"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Sunday",
    "iso_week": 36,
    "all_day": true,
    "duration_hours": 168.0,
    "category_string": "Meeting",
    "timestamp_epoch": 1757203200
  },
  {
    "title": "CTBT: Science and Technology Conference SnT 2025",
    "description": "Welcome to SnT 2025!\nThe Preparatory Commission for the Comprehensive Nuclear-Test-Ban Treaty Organization (CTBTO) relies on innovation to enhance the capabilities of the Treaty’s verification regime as well as to help move the Treaty closer to universalization and entry into force. As the eighth event in the CTBT: Science and Technology Conference series, SnT 2025 will bring together well over 1000 scientists, technologists, academics, students, and representatives of the CTBTO’s policy making organs. In addition, representatives from the fields of research and development, science diplomacy, science advisory, media and advocacy are invited to attend the conference. \nSnT2025 is scheduled to take place at the Hofburg Palace in Vienna, Austria and online, to create a worldwide inclusive conference and reach out to support globally. \nSnT 2025 Scientific Objectives\nTo identify methods and technologies that have the potential to improve nuclear-test-ban monitoring and on-site inspections, including emerging and game-changing approaches. \nTo highlight how scientific developments and cooperation can support national needs, frame policy objectives in support of the CTBT and promote its universalization. \nTo connect, inspire and integrate diverse communities involved in nuclear-test-ban monitoring and on-site inspection and to enhance diversity across gender, geography and generations, and to include early career professionals and youth. \nTo impact global society by promoting civil and scientific applications, capacity building and training, mentoring and skills development related to nuclear-test-ban monitoring and evolving verification techniques.",
    "start": "2025-09-08T00:00:00+00:00",
    "end": "2025-09-13T00:00:00+00:00",
    "url": "https://conferences.ctbto.org/event/30/",
    "location": "Hofburg Palace, Heldenplatz, Vienna, 1010, Austria",
    "organizer": "Preparatory Commission for the Comprehensive Nuclear-Test-Ban Treaty Organization CTBTO",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-07 06:31:01+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-07 06:36:50+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/01/SnT-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 37,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Conference",
    "timestamp_epoch": 1757289600
  },
  {
    "title": "AAS Glenn Space Technology Symposium",
    "description": "The 2025 AAS Glenn Space Technology Symposium is returning to Case Western Reserve University on September 8–10, 2025.This year, “Accelerating Aerospace Innovation”, the AAS Glenn Space Technology Symposium is joining the inaugural Ohio Space Week—a weeklong celebration of aerospace innovation in collaboration with Team NEO, NASA Glenn Research Center, and others.“Accelerating Aerospace Innovation” will spotlight the critical space technologies shaping the future of exploration. Discussions will explore key topics like the Artemis program, power planning for deep space missions, AI applications, the ever-changing industry, and more—bringing together top minds from government, industry, and academia.Be part of the conversation shaping the future of space technology.Secure your spot now: https://astronautical.org/events/john-glenn-memorial-symposium/",
    "start": "2025-09-08T12:00:00+00:00",
    "end": "2025-09-10T21:00:00+00:00",
    "url": "https://spacenews.com/event/aas-glenn-space-technology-symposium/",
    "location": "Case Western Reserve University, Cleveland, OH, United States",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-29 13:33:42+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-07-29 13:33:44+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 37,
    "all_day": false,
    "duration_hours": 57.0,
    "category_string": "",
    "timestamp_epoch": 1757332800
  },
  {
    "title": "Bali International Airshow 2025",
    "description": "About the Bali International Airshow\nThe Bali International Airshow is Southeast Asia’s premier exposition for aerospace, aero technology, and defense, dedicated to propelling Indonesia to the forefront of the regional aerospace industry. This prestigious event serves as a pivotal platform that unites diverse industry stakeholders to champion innovation in aerospace across Southeast Asia and Indonesia. \nHosted by the Coordinating Ministry for Maritime Affairs and Investment, the Ministry of Transportation, the Indonesian Air Force (TNI AU), and supported by the Ministry of Foreign Affairs, the Ministry of Tourism and Creative Economy, AirNav Indonesia, and Angkasa Pura Airports, the Bali International Airshow 2024 underscores Indonesia’s steadfast dedication to aerospace excellence. \nThe event encompasses a total area of 78,000sqm, consisting of a static aircraft display area covering more than 70,000 sqm and an exhibition hall spanning approximately 8,000 sqm. \nThe event will be welcoming: \n\nMore than 100 participating companies\nMore than 100 hosted delegations from over 35 countries/regions\n\nMINISTERIAL VIP DELEGATION & HOSTED COMMERCIAL BUYER PROGRAMME\nOur Ministerial VIP Delegation and Hosted Commercial Buyer Programme offers exhibitors the unique opportunity to engage with high-profile delegates. Sign up as an exhibitor to expand your network and showcase your offerings to aerospace and defense decision-makers. \nMINISTERIAL VIP DELEGATIONS\nJoin us to tap into the expertise, influence, and expansive networks of esteemed leaders from the defense and civil aviation sectors across 35 countries/regions. \nHOSTED COMMERCIAL BUYERS PROGRAMME\nBoost your business with our Hosted Buyers Programme. Effortlessly navigate B2B meetings and personalised matchmaking at the airshow. We host handpicked buyers from aviation and aerospace, paving the way for dynamic one-on-one meetings with exhibitors that drive industry growth.",
    "start": "2025-09-10T00:00:00+00:00",
    "end": "2025-09-14T00:00:00+00:00",
    "url": "https://www.baliairshow.com/",
    "location": "Ngurah Rai International Airport, General Aviation Terminal, Denpasar, Bali, Indonesia",
    "organizer": "Bali International Airshow",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-07 14:34:57+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-07 14:34:57+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/Bali-International-Airshow-2025.jpg",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Airshow",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Wednesday",
    "iso_week": 37,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "Airshow, Exhibition",
    "timestamp_epoch": 1757462400
  },
  {
    "title": "IBC 2025",
    "description": "Connecting Communities at IBC 2025\n\n\nBringing together the global media, entertainment and technology community, IBC 2025 is expected to welcome 45,000+ visitors from 170+ countries to connect, showcase and discover innovations, tackle pressing industry challenges, and explore new opportunities. \nAcross a bustling show floor and packed theatres, IBC 2025 will address critical trends and issues driving change across the media landscape while offering new show features, such as the AI Tech Zone, and IBC Talent Programme, that were introduced at IBC 2024. \nThemes that took centre stage included AI, fighting disinformation in news, sustainability, 5G, cloud, esports, immersive experiences, over-the-top (OTT) and streaming, adtech, metaverse, edge computing, the need to foster talent across the industry and many more. \nThe International Broadcasting Convention IBC 2025 will be back at the RAI, Amsterdam from 12-15 September 2025. \n\nAbout IBC\n\n\nIBC is the world’s most inspiring content and technology event. It draws together the global media, entertainment and technology industry for a compelling live experience that enables every attendee to gain critical insights, share expertise and unlock business opportunities. Created ‘by the industry, for the industry’ – a principle established on its founding in 1967 that carries through to today – IBC has continued to evolve with each new trend and technology over its 57-year history. Attracting representatives from 24 countries in its first year, IBC 2025 welcomes exhibitors, speakers and visitors from more than 170 nations. \n\n\n\n\nEach year, the show drives thought leadership, innovation, best practice and diversity across the 250,000-strong global IBC community. Owned by industry organisations IABM, IEEE BTS, IET, Royal Television Society, SCTE and SMPTE, the event offers a full schedule of groundbreaking presentations, panel sessions, workshops, product demos and technology masterclasses. \nIBC 2025 brings together tens of thousands from across the worldwide media content and technology community to learn, collaborate and network.",
    "start": "2025-09-12T00:00:00+00:00",
    "end": "2025-09-16T00:00:00+00:00",
    "url": "https://show.ibc.org/",
    "location": "RAI Convention Centre, Europaplein 24, Amsterdam, 1078GZ, Netherlands",
    "organizer": "International Broadcasting Convention LLP.",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-18 11:52:37+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-18 11:52:37+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/IBC-2025-Amsterdam.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Friday",
    "iso_week": 37,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "Conference, Exhibition",
    "timestamp_epoch": 1757635200
  },
  {
    "title": "EMER-GEN 2025",
    "description": "Welcome to EMER-GEN 2025!\nThe EMER-GEN 2025 Conference, taking place from September 14-16, 2025, in Maui, Hawaiʻi, is an essential event for young professionals and students eager to carve out careers in the space sector. This annual program, now in its eighth year, is a collaborative initiative between the Advanced Maui Optical and Space Surveillance Technologies (AMOS) Conference and the Space Generation Advisory Council (SGAC). EMER-GEN aims to inspire and equip the next generation of space leaders through mentorship, networking, and professional development. \nFocus on Young Professionals\nEMER-GEN 2025 is uniquely designed for individuals aged 18 to 35 who are passionate about space exploration and technology. The conference offers participants invaluable opportunities to engage with industry experts from government, academia, and the private sector. Through a series of interactive sessions, attendees will gain insights into various aspects of the space industry while building a robust professional network. \nEngaging Learning Experiences\nParticipants will benefit from a range of activities, including technical short courses led by specialists in space situational awareness. The program also features professional development sessions that focus on enhancing effectiveness in a global environment. These sessions include challenges and tabletop exercises that encourage innovative thinking and collaboration among participants. \nInnovation Challenge and Networking\nA highlight of EMER-GEN 2025 is the Innovation Challenge, where teams will work together to develop solutions for real-world problems facing the space industry. This hands-on experience fosters creativity and teamwork while allowing participants to pitch their ideas to industry leaders. Additionally, networking opportunities abound, enabling attendees to connect with peers and mentors who can guide their careers. \nPre-Event Webinars\nIn preparation for the conference, three webinars will be held starting August 27, 2025. These sessions will focus on fostering innovation and entrepreneurship among participants, setting the stage for a dynamic conference experience. Attendees are expected to participate in all webinars to maximize their learning and engagement. \nConclusion\nEMER-GEN 2025 promises to be an inspiring event that empowers young professionals to take significant steps toward their careers in space. With its focus on mentorship, innovation, and networking, this conference is not just an event; it’s a launchpad for future leaders in the space industry. Don’t miss this opportunity to be part of a transformative experience in Maui! \nAlso see the AMOS 2025 Conference, taking place immedately after EMER-GEN 2025",
    "start": "2025-09-14T00:00:00+00:00",
    "end": "2025-09-17T00:00:00+00:00",
    "url": "https://amostech.com/emer-gen/",
    "location": "Maui, Hawaii, Wailea, HI, United States",
    "organizer": "Maui Economic Development Board MEDB",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-14 14:09:29+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-14 14:09:29+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/01/emer-gen-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Networking Event"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Sunday",
    "iso_week": 37,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Conference, Networking Event",
    "timestamp_epoch": 1757808000
  },
  {
    "title": "44th Digital Avionics Systems Conference",
    "description": "The 44th AIAA/IEEE Digital Avionics Systems Conference (DASC) continues a rich tradition as the preeminent R&D conference in the field of digital avionics, offered by Digital Avionics Technical Committee (DATC) and co-sponsored by the American Institute of Aeronautics and Astronautics (AIAA) and the Institute of Electrical and Electronics Engineers (IEEE). \nAs the world’s leading conference on digital avionics technologies, they offer comprehensive topics in a diverse and collaborative environment for educational and professional opportunities. They are confident that you will have a memorable, inspiring, and educational experience. \n\n\nConference Theme:\n\nAVIONICS’ RESPONSIBILITY FOR SAFE AND SUSTAINABLE NEXT GENERATION AEROSPACE OPERATIONS \n\n\n\n\n\n\n\nDigital avionics are the foundation for the kind of aviation and space flight we feel familiar with today, but aerospace finds itself in an era of tremendous changes: societal demands and geopolitical changes are transforming aerospace towards higher customization, more autonomy, greener operation and faster adaptability. \nDigital avionics systems are the core enablers for many of the new technologies, functions, and operations necessitated by these changes. Furthermore, avionics systems will need to undergo a transformation towards reduced carbon footprint, higher calculation power, lower latency, and higher flexibility – all while maintaining safety and security levels and decreasing certification times: a huge responsibility for the digital avionics systems of the future. \nThe 44th DASC will investigate the responsibility of digital avionics for the next generation of air and space vehicles to come. We provide the forum to present solutions making aerospace transformation possible, analyze open issues, and discuss disruptive ideas.",
    "start": "2025-09-14T00:00:00+00:00",
    "end": "2025-09-19T00:00:00+00:00",
    "url": "https://2025.dasconline.org/",
    "location": "Hotel Bonaventure, 900 DE LA GAUCHETIÈRE WEST, Montreal, Quebec, H5A 1E4, Canada",
    "organizer": "Institute of Electrical and Electronics Engineers IEEE",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-17 16:11:14+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-02-04 11:23:09+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/01/DASC-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Sunday",
    "iso_week": 37,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Conference",
    "timestamp_epoch": 1757808000
  },
  {
    "title": "International Electric Propulsion Conference (IEPC2025)",
    "description": "The 39th International Electric Propulsion Conference (IEPC) will be held in London from 14 to 19 September 2025. This conference, hosted in the United Kingdom for the first time, will focus on the theme “Electric Propulsion, a Gateway to the Cosmos”. \nThe event will cover advancements in electric propulsion, addressing challenges and innovations in the field. The program includes technical sessions, discussions on research and development roadmaps, and updates on the latest progress in spacecraft propulsion technologies. \nDetails on social events, excursions, and additional activities can be found on the official conference website.",
    "start": "2025-09-14T00:00:00+00:00",
    "end": "2025-09-20T00:00:00+00:00",
    "url": "https://www.iepc2024.com/en/home.html",
    "location": "Imperial College London, Exhibition Rd, South Kensington, London, London, England, United Kingdom",
    "organizer": "American Institute of Aeronautics and Astronautics AIAA",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-06 16:26:17+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-16 11:12:34+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/IEPC2025_HeadBanner.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Congress",
      "Networking Event",
      "Seminar"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Sunday",
    "iso_week": 37,
    "all_day": true,
    "duration_hours": 144.0,
    "category_string": "Conference, Congress, Networking Event, Seminar",
    "timestamp_epoch": 1757808000
  },
  {
    "title": "SPIE Sensors + Imaging 2025",
    "description": "SPIE Sensors + Imaging combines two of Europe’s best photonics conferences – SPIE Environmental Remote Sensing and SPIE Security + Defence \nMake plans to participate and learn about latest insights, and breakthroughs. Call for papers opens in January. \nThe premier yearly European event that showcases the latest sensor and photonic technologies for imaging and monitoring the Earth’s atmosphere and environment, as well as sensor technologies that address homeland security, defence, and counterterrorism. \nMeet face-to-face with top companies at the free 2-day exhibition. Discuss your sensing and imaging needs with suppliers who will be there to help solve problems, cut costs, and increase capabilities. \nConnecting with your community\nEnjoy four days of exciting content and connecting with your community \n\nPlenary talks\nTechnical presentations\nNetworking sessions\nProfessional development\nAn exhibition\n\nThe exhibition\nThe free exhibition offers a look at innovative technologies from detectors and sensors to lasers and imaging equipment. Make time for the exhibition to learn about various components, devices, and systems comprising the latest innovative technologies for the security and defence and remote sensing application spaces. Find solutions from companies whose products and innovations drive industry. The exhibition is free.",
    "start": "2025-09-15T00:00:00+00:00",
    "end": "2025-09-19T00:00:00+00:00",
    "url": "https://spie.org/conferences-and-exhibitions/sensors-and-imaging",
    "location": "IFEMA Madrid, Avda. del Partenon, 5, Madrid, 28042, Spain",
    "organizer": "SPIE",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-17 11:48:01+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-17 11:48:01+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/SPIE-Sensors-Imaging-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "Conference, Exhibition",
    "timestamp_epoch": 1757894400
  },
  {
    "title": "EUMETSAT Meteorological Satellite Conference 2025",
    "description": "The 2025 EUMETSAT Meteorological Satellite Conference will take place in Lyon, France on 15 – 19 September. EUMETSAT will be joined in the organisation and hosting of the event by Météo-France, the national weather and climate services provider in France. \nOver the years, the EUMETSAT user conference has become a key annual event for the meteorological and scientific communities where participants from around the world can meet to share their experience and knowledge during plenary, poster and workshop sessions. \nThe overarching theme of the conference is “From Space to Safety: Earth Observation for Future Weather and Climate Preparedness”. \nFurther information about the scientific content will be made available with the first announcement in January 2025. \nFirst announcement and call for papers: January 2025 \nVenue\nThe venue for our conference is the Lyon Convention Centre, offering modern conference facilities and generous exhibition and foyer spaces. It is located in the heart of the Renzo Piano designed Cité Internationale, a quarter in the 6th arrondissement of Lyon. The modern area offers a wide array of restaurants and entertainment opportunities, together with a direct access to the Parc de la Tête d’Or, Lyon’s biggest park. \nLyon is the third largest city in France situated at the confluence of the rivers Rhône and Saône. The city is recognised for its cuisine and gastronomy, as well as historical and architectural landmarks; as such, the districts of Old Lyon, the Fourvière hill, the Presqu’île and the slopes of the Croix-Rousse are named on the UNESCO World Heritage List. Lyon was historically an important area for the production and weaving of silk, and played a significant role in the history of cinema since Auguste and Louis Lumière invented the cinematograph there. \nIn celebration of Lyon’s gastronomy and the city’s unique location, our networking events will be held respectively at the Abbaye de Collonges, founded by Paul Bocuse, Lyon’s most famous Chef, and at the Musée des Confluences, located at the southern tip of the Presqu’île where the Rhône and Saône meet. \nSponsors\nEUMETSAT offers interesting sponsorship options. If your institution is interested in sponsoring the conference, please contact userconference@eumetsat.int for details. \nEarly Career Scientist Initiative\nEUMETSAT believes in fostering the scientists of the future, and invite applications for our early career scientist initiative. Applications are open from anyone aged 32 or younger who have up to 24 months of job experience. Eligible papers should cover any use and application of EUMETSAT satellite data along the main themes of the conference. \nThe Scientific Programme Committee will select five papers that receive an award, consisting of travel funding and free conference participation for the EUMETSAT conference in 2025. The selected papers will be especially promoted during the conference. \nPlease note that winners of previous awards are not eligible to apply for the award again, though they remain welcome to present their papers at the conference. Previous winners attending a future conference may also be invited to participate in the Scientific Programme Committee.",
    "start": "2025-09-15T00:00:00+00:00",
    "end": "2025-09-20T00:00:00+00:00",
    "url": "https://www.eumetsat.int/eumetsat-meteorological-satellite-conference-2025",
    "location": "Centre de Congrès de Lyon, 50 quai Charles de Gaulle Cité Internationale, Lyon, 69006, France",
    "organizer": "EUMETSAT",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-02 15:06:05+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-16 11:12:46+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/EUMETSAT-Meteorological-Satellite-Conference-2025.jpg",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Conference",
    "timestamp_epoch": 1757894400
  },
  {
    "title": "World Space Business Week WSBW 2025",
    "description": "Bringing Together the World’s Industry Leaders\nThe World Space Business Week (WSBW)– the leading global business space event – brings together decision makers under the same roof for a week of deal-making and intense discussions shaping the future of the industry. \nFor 27 years, the World Space Business Week (WSBW) has been a distinguished C-level executive summit, providing a quality platform for influential and forward-thinking leaders from international private and public organizations. This annual event serves as a hub for addressing critical industry issues, sharing insights and best practices, stimulating innovation, conducting business, and shaping the future of the sector. \nWidely acknowledged as the must-attend event by key industry players, the WSBW gathers future investors, innovators, clients, and partners under the same roof. It facilitates exchanges and deal-making for decision-makers from all over the world and the entire ecosystem, solidifying its position as an indispensable event in the industry for 27 years and counting. \nWhere Decision Makers Do Business\nThe very essence of the summit is to provide an exclusive setting conducive to making business, finding inspiration and gaining insights to stay at the cutting edge of competitiveness and develop successful business strategies. \nSummit for Satellite Financing\nThe three-day flagship event welcomes senior executive speakers from leading organizations, as well as industry newcomers, who share experiences, best-practices, industry insights & challenges across topics such as cloud & connectivity, constellations, and finance. \nA top-level program featuring topics addressed by 120+ speakers such as investment outlooks, debt financing, financial analysts, leading global and regional operators, leading connectivity service providers, satellite connectivity, the role of satellite and ground integration for IoT and cloudification, smallsats, NGSO broadband constellations, manufacturers, and launchers to mention some. \nSummit on Earth Observation Business\nThe Earth Observation market is rapidly growing. With the promises of new-generation sensors and constellations taking shape, geospatial solutions are evolving, transforming the way in which we collect, analyze and present data. BigData and AI, cloud computing-based services and enhanced analytics capabilities are driving and fuelling satellite-driven solutions demand and use globally in numerous vertical markets such as climate, maritime, agriculture and more. \nSince 2009 the Summit on Earth Observation Business has been serving as a forum where senior-ranking executives, investors and government officials from the satellite imagery and geospatial solutions sector from 40+ countries come together to conduct business, inspire and gain insights to further business strategies. Through fireside chats and panel discussions covering the entire Earth Observation and geospatial value-added chains 70+ speakers address the latest market challenges and opportunities, market evolutions, and leverage best practices to inspire the future. \nThe Space Defense & Security Summit\nExceptional Business Perspectives & Synergies with the WSBW. The Space Defense & Security Summit (SDSS) aligns seamlessly with the World Space Business Week (WSBW), creating a dynamic synergy that amplifies opportunities for all participants. \nFor defense actors engaged in SDSS, this convergence with WSBW in Paris signifies a strategic opportunity, as it increases the potential for delegates to engage with the vibrant ecosystem already flourishing at WSBW. \nThe strategic proximity of both events fosters ideal opportunities for interactions with potential investors, innovators, clients, and partners, facilitating seamless exchanges and catalyzing deal-making prospects. \nAbout the Organizer\nExecutive Summits are just one aspect of Novaspace’s offerings, which emerged from the merger of Euroconsult and SpaceTec Partners. Our services span four key areas: Management Consulting, Technology Consulting, Market Intelligence, and Executive Summits. In addition to our renowned Executive Summits, we provide top-tier strategic consulting and comprehensive market intelligence products tailored to the space industry. \nThe uniqueness of our business model is based on synergies created by the complementarity of our four activities. Each activity increases our market knowledge and expertise and extends our network of key decision makers. \nWe have over fourty years of experience accompanying private companies and government entities in strategic decision making. A reference for high quality market knowledge worldwide, we use our deep industry knowledge and analytical rigor to help our clients understand their business environment and provide them with the tools they need to make informed decisions and develop their business.",
    "start": "2025-09-15T00:00:00+00:00",
    "end": "2025-09-20T00:00:00+00:00",
    "url": "https://wsbw.com/",
    "location": "Hôtel du Collectionneur, 51-57 Rue de Courcelles, Paris, 75008, France",
    "organizer": "Novaspace",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-11 11:43:25+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-11 11:43:25+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/WSBW-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Conference",
    "timestamp_epoch": 1757894400
  },
  {
    "title": "IAU Symposium 402: Massive Stars Across Redshifts",
    "description": "IAU Symposium 402: Massive Stars Across Redshifts in the Era of JWST and Large-Scale Surveys \nScientific Motivation\nAlthough massive stars are crucial in solving the cosmic puzzle as they are key contributors of ionizing radiation, metals, cosmic rays and dust and, when they die, of neutron stars, black holes, and gravitational waves, many competing factors, are thought to influence their observed properties and challenge our understanding of how these stars evolve and contribute to the Universe. \nThe Massive Stars Commission (G2) of the IAU’s Stars and Stellar Physics Division regularly organizes a symposium, typically every 4 years, to present the latest research findings in the field, discuss the status of current research in massive stars, and chart the way forward for future research. The first meeting was in Argentina in 1971, and in the last decade we organized “Massive Stars: from Alpha to Omega” in Greece (2013), “IAUS 329: The Lives and Death Throes of Massive Stars” in New Zealand (2016), and “IAUS 361: Massive Stars Near and Far” in Ireland (2020, postponed to 2022 due to the pandemic). \nSince the last symposium organized by the G2 commission (IAUS 361, 2022), the James Webb Space Telescope is dramatically changing our understanding of the early Universe. Important discoveries at high redshift have been made, including galaxies that are too massive for their age, systems with oxygen abundances typical of much later epochs of the Universe, and possible signatures of Pop III stars at z=10. Massive stars, through population synthesis codes,\nare critical to simulate the evolution and early chemical enrichment of galaxies in the infant Universe, and to analyse the observed spectra of these very high redshift systems. \nMany improvements have been made on individual stars, close binaries and population synthesis models. \nA better understanding of the impact of massive stars on their surroundings has been achieved and, in addition, analysis techniques are also increasingly sophisticated. These involve accounting for improved or more complete physics, better atomic data, and/or evolving from 1-dimensional to 3D models in the simulations of stellar structure and winds. \nDespite the large progress, however, outstanding open questions on massive star evolution and winds remain (e.g. the role of metallicity, true mass loss rates, internal transport mechanisms and magnetic fields to name a few). The view of massive star evolution also needs to be reconciled with the view of the massive star graveyard drawn by gravitational wave experiments. These issues, to be discussed in this symposium, need to be solved to properly account for the role of massive stars across cosmic time, and to maximize the return of empirical datasets and models in the era of JWST and large surveys (SDSS V Mappers, SKA, and Rubin/LSST, among others). \nFortunately, the field of massive stars is entering a new era also enabled by large scale spectroscopic surveys. By targeting vast samples of massive stars in the Milky Way and our neighbours the Magellanic Clouds, IACOB, WEAVE, 4MOST, SDSS IV APOGEE, HST-ULLYSES, and VLT-XShootU, as well as complementary observations, will soon enable detailed constraints on theory obtained thanks to quantitative spectroscopic analyses. In addition, new promising research areas are emerging, such as massive-star asteroseismology, that is providing an unprecedented view of their interior. This symposium will enable the experts from complementary communities to gauge the progress that has been made so far and identify areas that still require improvements. Ideas for new technology may also emerge. \nVenue and Lodging\nIAUS 402 will take place at Hotel Coral y Marina, Ensenada, Baja California, Mexico.",
    "start": "2025-09-15T00:00:00+00:00",
    "end": "2025-09-20T00:00:00+00:00",
    "url": "https://astronomia.unam.mx/iaus402_massivestars/",
    "location": "Hotel Coral y Marina, Km. 103 Carretera Tijuana-Ensenada 3421, Zona Playitas, Ensenada, Baja California, 22870, Mexico",
    "organizer": "IAU International Astronomical Union",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-15 13:09:49+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-15 13:09:49+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/IAU-Symposium-402-Massive-Stars.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Symposium"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Symposium",
    "timestamp_epoch": 1757894400
  },
  {
    "title": "World Space Business Week",
    "description": "Bringing Together the World’s Industry LeadersThe World Space Business Week (WSBW) is the premier global event for the space industry, uniting 1,600 decision-makers for a week of transformative discussions and high-stakes deal-making. With a legacy spanning 28 years, WSBW has become the definitive gathering for C-level executives to foster innovation, build partnerships, and shape the future of space business.WSBW 2025 Highlights:– 1,600 Industry Decision-Makers– 90% C-Level Attendees– 260+ Executive-Level Speakers– 110+ Partners & Sponsors– 520+ Public and Private Organizations– Representation from 50+ CountriesDate: September 15–19, 2025Venue: Hôtel du Collectionneur | Paris, FranceSecure Your Spot: Register Now!Join the global leaders driving the space sector forward. Don’t miss your chance to be part of the conversation!",
    "start": "2025-09-15T12:00:00+00:00",
    "end": "2025-09-19T21:00:00+00:00",
    "url": "https://spacenews.com/event/world-space-business-week/",
    "location": "Hotel du Collectionneur, 51-57 Rue de Courcelles, Paris, 75008, France",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-30 22:27:58+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-07-25 15:39:03+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 38,
    "all_day": false,
    "duration_hours": 105.0,
    "category_string": "",
    "timestamp_epoch": 1757937600
  },
  {
    "title": "The Drop",
    "description": "The Drop 2025 is a groundbreaking event that stands at the forefront of Europe’s investment future, renowned for its unique ability to bridge gaps and explore niches with a festival-like atmosphere. This pivotal conference draws an eclectic mix of attendees, offering them an unparalleled platform to engage with cutting-edge discussions and innovative solutions. \nMain topics or themes covered: \n\nClimate Risk\nGeothermal\nRobotics\nGeopolitics\nRegenerative Agriculture\n\nTarget audience:The Drop is tailored for investors, industry professionals, policymakers, and innovators eager to delve into future-forward investments and technologies across diverse sectors. \nEvent highlights:– Extensive networking opportunities with leading experts– Engaging roundtable discussions on niche subjects– Unique side events hosted by attendees around the city– Immersive festival vibes with surprise content– Focus on bridging gaps in critical industries \nSeize the opportunity to be part of The Drop 2025, where the future of investment and innovation collide, offering an unmissable experience for all forward-thinkers. \nKeywords: investment, innovation, Europe, future-forward, networking",
    "start": "2025-09-16T00:00:00+00:00",
    "end": "2025-09-19T00:00:00+00:00",
    "url": "https://thedropconf.com/",
    "location": "Malmö City Center, Malmö, Sweden",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:22:38+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:27:51+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "AI",
      "Climate Change",
      "Climate Tech",
      "Europe",
      "Finance",
      "Investment",
      "Robotics",
      "Sustainability",
      "Sweden"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Tuesday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "AI, Climate Change, Climate Tech, Europe, Finance, Investment, Robotics, Sustainability, Sweden",
    "timestamp_epoch": 1757980800
  },
  {
    "title": "Space Defense & Security Summit",
    "description": "Welcome to the Premier Space Defense & Security Summit\nThe first edition of SDSS exceeded all expectations, marking an extraordinary success with over 450 registered delegates from more than 35 countries. With 66 experts on stage and 34 partners and sponsors, SDSS fostered critical discussions on space defense, security, and international cooperation. This strong participation solidifies SDSS as a premier platform for global leaders shaping the future of space and defense. \nBuilding on these positive results we are delighted to announce that SDSS will return for a second edition to take place on September 16-17, 2025, at the sophisticated Les Salons Hoche. \nSDSS will be held just a short five-minute walk from the World Space Business Week’s venue – the Hôtel du Collectionneur. The proximity of the two venues will allow seamless integrations between participants of both events, fostering unparalleled synergies across the space community. \nNew Space Security & Defense Perspective\nThis event will feature outstanding speakers and leading organizations representing the space and security community, covering major themes within the rapidly evolving landscape of this industry. \nAs space transforms into an operational domain for sovereignty, defense, and security, the contours of these realms are rapidly shifting. The increasing contestation in space necessitates diverse missions and resources, prompting the imperative need for new cooperation models and investments across technological and human domains. \nMoreover, the evolution of commercial systems sparks a fundamental reconsideration of how defense space activities are organized. At SDSS, we will delve into these pressing matters, exploring strategies to navigate this dynamic environment. \nExceptional Business Perspectives​ & Synergies with the WSBW\nThe Space Defense & Security Summit aligns seamlessly with the World Space Business Week, creating a dynamic synergy that amplifies opportunities for all participants, speakers, and sponsors alike.​ \n​For defense stakeholders attending SDSS, this alignment with WSBW in Paris presents a strategic advantage, offering increased opportunities for delegates to engage with the thriving ecosystem already in place at WSBW.​ \n​The strategic proximity of both events provides an ideal setting for connecting with potential investors, innovators, clients, and partners, thus fostering interactions and driving deal-making opportunities.​",
    "start": "2025-09-16T00:00:00+00:00",
    "end": "2025-09-18T00:00:00+00:00",
    "url": "https://sds-summit.com/",
    "location": "Les Salons Hoche, 9 Avenue Hoche, Paris, 75008, France",
    "organizer": "Novaspace",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-11 11:53:19+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-11 11:53:19+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/Space-Defense-Security-Summit-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Tuesday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Conference",
    "timestamp_epoch": 1757980800
  },
  {
    "title": "Advanced Maui Optical and Space Surveillance Technologies Conference AMOS 2025",
    "description": "Welcome to AMOS 2025!\nThe AMOS 2025 Conference is set to take place from September 16-19, 2025, at the stunning Wailea Beach Resort in Maui, Hawaiʻi. As the premier technical conference dedicated to space situational awareness (SSA) and space domain awareness (SDA), AMOS 2025 promises to be an essential gathering for professionals across government, academia, and the private sector. \nOverview of the AMOS 2025 Conference\nThe Advanced Maui Optical and Space Surveillance Technologies (AMOS) Conference has established itself as a leading platform for discussing critical issues in space safety and sustainability. With a rich history spanning over two decades, AMOS has continually adapted to the evolving landscape of space exploration and technology. The conference fosters collaboration among diverse stakeholders, facilitating discussions that are vital for the future of space operations. \nImportance of Space Situational Awareness\nAs more nations and private entities engage in space activities, the need for robust SSA/SDA has never been more pressing. The AMOS conference serves as a vital forum for addressing these challenges. Attendees can expect to engage in discussions about the latest advancements in technology, policy frameworks, and international cooperation efforts aimed at ensuring a safe and sustainable space environment. This year’s event will emphasize the importance of shared knowledge and collaborative strategies in tackling emerging threats in space. \nNetworking Opportunities\nOne of the standout features of AMOS 2025 is its focus on networking. The conference provides numerous opportunities for participants to connect with industry leaders, technical experts, and policymakers. By fostering these connections, AMOS aims to promote innovative partnerships that can lead to groundbreaking advancements in SSA/SDA technologies. Attendees will have the chance to participate in technical presentations, panel discussions, and keynotes from prominent figures in the field. \nKey Themes and Discussions\nThe agenda for AMOS 2025 will cover a wide range of topics relevant to current trends in SSA/SDA. Participants can look forward to sessions addressing: \n\nTechnological Innovations: Exploring cutting-edge technologies that enhance space surveillance capabilities.\nInternational Collaboration: Discussing frameworks for cooperation among nations to ensure collective security in space.\nPolicy Development: Engaging with policymakers on regulations that govern space activities and protect assets in orbit.\n\nCelebrating a Milestone\nAMOS 2025 marks a significant milestone as it builds upon the successes of previous conferences. The event reflects the growing interest in space sustainability and commerce initiatives, highlighting the critical role that diverse stakeholders play in shaping the future of space exploration. With an anticipated increase in attendance from various countries, this year’s conference is expected to be one of the largest yet. \nConclusion\nIn conclusion, attending AMOS 2025 offers a unique opportunity for professionals involved in SSA/SDA to gain insights into the latest developments while connecting with like-minded individuals committed to advancing space safety. As we approach this landmark event, it is clear that AMOS continues to be an indispensable part of the global conversation on space situational awareness. Don’t miss your chance to be part of this transformative experience at Wailea Beach Resort in Maui!",
    "start": "2025-09-16T00:00:00+00:00",
    "end": "2025-09-20T00:00:00+00:00",
    "url": "https://amostech.com/",
    "location": "Wailea Beach Resort Marriott, 3700 Wailea Alanui Dr, Wailea, HI, 96753, United States",
    "organizer": "Maui Economic Development Board MEDB",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-14 13:55:04+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-14 13:55:04+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/01/AMOS-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Tuesday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "Conference",
    "timestamp_epoch": 1757980800
  },
  {
    "title": "Space Defense and Security Summit",
    "description": "Uniting Leaders, Shaping the Future of Space SecurityBack for its second edition following the tremendous success of 2024, the Space Defense & Security Summit (SDSS) is the premier platform for advancing space security and defense strategies. Held in collaboration with international defense and military organizations and aligned with the World Space Business Week (WSBW), SDSS brings together global leaders from defense, security, and space sectors. Engage with government representatives, top private stakeholders, and thought leaders to shape the future of space exploration and security.SDSS 2025 Highlights– 60+ Top-Tier Speakers– 300+ International Leaders– Representation from 35+ Countries– 30+ Sponsors & PartnersDate: September 16–17, 2025Venue: Les Salons Hoche, Paris – FranceLocated in the heart of Paris, just a 4-minute walk from WSBW, this exclusive venue offers a premium setting for high-level discussions.Secure Your Spot Now: Register Today!Building on last year’s success, this year’s edition will deepen critical conversations and inspire actionable solutions for space security and defense. Be part of the transformation!",
    "start": "2025-09-16T12:00:00+00:00",
    "end": "2025-09-17T21:00:00+00:00",
    "url": "https://spacenews.com/event/space-defense-and-security-summit/",
    "location": "Les Salons Hoche, 9 Av. Hoche, Paris, 75008, France",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-30 22:20:39+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-30 22:21:01+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Tuesday",
    "iso_week": 38,
    "all_day": false,
    "duration_hours": 33.0,
    "category_string": "",
    "timestamp_epoch": 1758024000
  },
  {
    "title": "Space Innovation Forum 2025",
    "description": "The Space Innovation Forum 2025 returns to Kiruna for two dynamic days focused on innovation, sustainability, and the future of space. Hosted by Space Sweden North, this high-energy event brings together policymakers, entrepreneurs, engineers, researchers, and students to explore real-world space tech, emerging challenges, and collaborative solutions. From student-driven innovation pitches and workshops to discussions on sustainability in the supply chain, 6G satellite comms, and open innovation, the forum offers a mix of keynotes, panels, interactive sessions, and networking. Confirmed speakers include top leaders from SSC, OHB Sweden, LTU, Aalto University, Vinnova, Swedish Armed Forces, and the Swedish Space Agency. Whether you’re part of a space agency or startup, academia or local government, this is your platform to connect, collaborate, and shape the next frontier. \nDay 1 focuses on vision, networking, and high-level discussions in a central venue.\n📍 Venue Day 1: Aurora Kultur och Kongress, Stadshustorget 10, Kiruna \nDay 2 shifts to a more technical, immersive environment at Space Campus to dive into workshops and applied innovation.\n📍 Venue Day 2: Space Campus, Bengt Hultqvists Väg 1, Kiruna",
    "start": "2025-09-17T00:00:00+00:00",
    "end": "2025-09-19T00:00:00+00:00",
    "url": "https://sif.confetti.events/",
    "location": "Aurora Kultur och Kongress, Stadshustorget 10, Kiruna, kiruna, Sweden",
    "organizer": "Space Sweden North",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-06-24 11:49:37+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-06-24 11:49:37+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/06/Screenshot-2025-06-24-144459-NEW-EVENT.png",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Wednesday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Conference",
    "timestamp_epoch": 1758067200
  },
  {
    "title": "The Space Logistics Conference",
    "description": "Welcome to The Space Logistics Conference 2025\nThe Space Logistics Industry is on track to generate $21 Billion by 2040, 20% of the total revenue of the space economy. \nSAE Media Group has closely followed the progress of the field for three decades and it’s clear the community is standing on the precipice of a new era. The Space Logistics Conference is the only event which will bring together the vital stakeholders who are charting the future of the orbital ecosystem in one place, with a distinct focus on government policy, regulation and partnership opportunities that you will not find elsewhere. \nThis is your chance to connect with these leaders, learn about successes as well as challenges and shape the way ahead. \nOrbital technology is going to radically alter the space environment. Satellites are going to be refuelled and repaired, or have their orbits shifted and access to space will be more reliable and affordable. A wide-ranging logistics architecture is going to be established to enable exploration from the Moon to Mars, as well as deeper into the solar system. Closer to Earth, a robust cargo transfer network is going to be vital for manufacturing cutting edge technology in orbit. These topics are the foundation of The Space Logistics Conference. \nHow will The Space Logistics Conference Look?\n25+ plenary presentations from leading experts in the field will give you exclusive knowledge and inspiration. Sharing insights on vital topics such as movement of cargo, last-mile delivery, payload hosting, propulsion, sustainability, servicing and how best to work with government partners. \nDedicated networking time where you can connect, share experiences, discuss common issues, and work together towards industry goals with top-tier experts, all gathered in one place at one time. \nA bustling exhibition space with stands from key companies in the field, ready to share and explore the latest tech and innovations.\nA chance to hear the holistic view of NASA technology and policy through a wide-ranging list of subject matter experts and senior leaders.\n150+ representatives from all the key institutions in the field of Space Logistics. \nDon’t miss out – this is your exclusive opportunity to stay at the forefront of Space Logistics. Be part of the first instalment of this groundbreaking event. Make history with your community and enhance your programs to remain a step ahead! \nCultivate indispensable connections that may serve as the driving force behind your next significant breakthrough! \nShould you wish to join the increasing number of companies benefiting contact Justin Predescu, Sponsorship Manager on +44 (0) 20 7827 6130 or justin.predescu@saemediagroup.com",
    "start": "2025-09-18T00:00:00+00:00",
    "end": "2025-09-20T00:00:00+00:00",
    "url": "https://www.smgconferences.com/defence/northamerica/conference/Space-Logistics",
    "location": "TBA/Arlington, Arlington, VA, United States",
    "organizer": "SAE Media Group",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-20 13:19:20+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-20 13:19:20+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/The-Space-Logistics-Conference.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition",
      "Networking Event"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Thursday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Conference, Exhibition, Networking Event",
    "timestamp_epoch": 1758153600
  },
  {
    "title": "AFA National Convention 2025",
    "description": "AFA National Convention 2025\nThe Air & Space Forces Association is governed by our National Convention body under the structure of the AFA Bylaws. \nFor the 2024 AFA National Convention, AFA welcomed 152 official delegates from across the country and abroad. Delegates participated in four Chapter-focused workshops and a two-day business session which included keynotes from AFA leaders and special guests, including Civil Air Patrol’s National Commander, Maj. Gen. Regena Aye. \nThe AFA National Convention 2025 will be held at National Harbor, MD, on 20 and 21 September 2025. More info will follow. \n ",
    "start": "2025-09-20T00:00:00+00:00",
    "end": "2025-09-22T00:00:00+00:00",
    "url": "https://www.afa.org/national-convention/",
    "location": "Gaylord National Resort & Convention Center, 201 Waterfront Street, National Harbor, MD, 20745, United States",
    "organizer": "Air & Space Forces Association AFA",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-11 10:26:50+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-11 10:29:26+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/AFA-National-Convention.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Saturday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Conference",
    "timestamp_epoch": 1758326400
  },
  {
    "title": "European Microwave Week EuMW 2025",
    "description": "Welcome to the 28th European Microwave Week\n\nThe 28th edition of the European Microwave Week (EuMW 2025) will come to Utrecht to continue the annual series of highly successful microwave events that started back in 1998. EuMW 2025 comprises three co-located conferences: \nThree Conferences, Three Forums, One Week, One Location: Learn more about each conference and forum below. For those interested in hosting a Workshop, Short Course, Focussed or Special Session, you can find the proposal templates on this page as well. \n\nThe European Microwave Conference (EuMC)\n23 – 25 September 2025 \nJoin us at the 2025 European Microwave Conference in Utrecht, The Netherlands, from September 23-25, 2025. This premier event, part of European Microwave Week, is dedicated to microwave, millimetre-wave, and terahertz technologies. Engage with peers and experts, explore cutting-edge topics like 6G, IoT, and sustainable RF technologies, and discover the latest advancements in high-frequency devices and systems. With over 50 sessions, this conference offers exceptional networking opportunities and insights into both academic and industrial applications. Don’t miss this chance to be at the forefront of microwave innovation! \nThe European Microwave Integrated Circuits Conference (EuMIC)\n22 – 23 September 2025 \nJoin us at the 20th European Microwave Integrated Circuits Conference (EuMIC) in Utrecht, The Netherlands, from September 22-23, 2025. This premier event, part of European Microwave Week, is dedicated to RF, microwave, millimetre-wave, and terahertz electronics. Engage with experts, explore cutting-edge topics, and discover the latest advancements in integrated circuit technology. With a focus on innovation and networking, this conference offers exceptional opportunities to connect with the community and stay at the forefront of technological trends. Don’t miss this chance to be part of the future of integrated circuits! \nThe European Radar Conference (EuRAD)\n24 – 26 September 2025 \nJoin us at the 22nd European Radar Conference (EuRAD 2025) from September 24-26, 2025, in Utrecht, The Netherlands, as part of European Microwave Week 2025. This premier event will showcase cutting-edge radar research, technologies, and applications. Connect with global experts and explore topics like Radar Principles and Modelling, Radar Technologies, Radar Signal Processing, Algorithms and AI, and Radar Applications. Don’t miss this opportunity to be at the forefront of radar innovation and network with leading researchers and practitioners. Submit your papers and be part of shaping the future of radar! \nThe European Microwave Exhibition\n23 – 25 September 2025 \nEurope’s Premier RF, Microwave, Radar and Wireless Event is the largest trade show dedicated to Microwaves and RF in Europe, providing: \n\n8,000 sqm of gross exhibition space\nAround 4,000 key visitors from around the globe\n1,500 – 1,700 conference delegates\nIn excess of 300 international exhibitors (including Asia and US as well as Europe)\n\n  \nThe exhibition will offer its exhibitors an unrivaled opportunity to present products, technological developments and form relationships with relevant and interested spectators including academics, professionals and industry figureheads. It also offers a forum for discussing trends and exchanging scientific and technical information.",
    "start": "2025-09-21T00:00:00+00:00",
    "end": "2025-09-27T00:00:00+00:00",
    "url": "https://www.eumw.eu/",
    "location": "Jaarbeurs Utrecht, Jaarbeursplein 6, Utrecht, 3521AL, Netherlands",
    "organizer": "European Microwave Association",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-18 12:06:10+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-18 12:06:10+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/European-Microwave-Week-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Sunday",
    "iso_week": 38,
    "all_day": true,
    "duration_hours": 144.0,
    "category_string": "Conference, Exhibition",
    "timestamp_epoch": 1758412800
  },
  {
    "title": "III Congresso Aeroespacial Brasileiro",
    "description": "Introdução ao III Congresso Aeroespacial Brasileiro 2025\nO III Congresso Aeroespacial Brasileiro (III CAB), programado para ocorrer em 2025, representa um marco significativo na promoção da colaboração entre as instituições que atuam nos setores aeronáutico e espacial no Brasil. Este evento bienal é uma plataforma essencial para pesquisadores, acadêmicos, e profissionais do setor discutirem inovações, desafios e oportunidades no campo aeroespacial. Com o objetivo de fortalecer a sinergia entre universidades, centros de pesquisa e indústria, o congresso promove um ambiente propício para a troca de conhecimentos e experiências. \nTemas Cruciais\nDurante o III CAB, serão abordados temas cruciais como tecnologia espacial, defesa, e sustentabilidade. O evento contará com palestras de especialistas renomados, painéis de discussão e sessões técnicas que visam aprofundar a compreensão sobre as tendências atuais e futuras do setor. Além disso, o congresso incentivará a apresentação de trabalhos acadêmicos, permitindo que novos talentos tenham a oportunidade de compartilhar suas pesquisas com uma audiência qualificada. \nAvanço da Pesquisa e Desenvolvimento\nA realização do III CAB é fundamental para o avanço da pesquisa e desenvolvimento no Brasil, especialmente em um momento em que o país busca se destacar no cenário global da tecnologia espacial. Com a participação de representantes do governo, da academia e da indústria, o congresso promete ser um catalisador para iniciativas inovadoras que poderão transformar o setor aeroespacial brasileiro. \nWelcome to the 3rd Brazilian Aerospace Congress 2025\nA Vital Platform\nThe III Brazilian Aerospace Congress (III CAB) is set to take place in 2025 and aims to enhance collaboration among institutions in the aerospace and aeronautics sectors in Brazil. This biennial event serves as a vital platform for researchers, academics, and industry professionals to discuss innovations and challenges within the aerospace field. \nKey Topics\nKey topics at the congress will include space technology, defense, and sustainability. The event will feature renowned experts delivering lectures, panel discussions, and technical sessions to deepen understanding of current and future trends in the sector. Additionally, it encourages the presentation of academic papers, providing emerging talents with the chance to share their research with a qualified audience. \nImportance for Brazil\nThe III CAB is crucial for advancing research and development in Brazil as the country seeks to establish itself on the global stage of space technology. With participation from government representatives, academia, and industry leaders, the congress is expected to catalyze innovative initiatives that could transform the Brazilian aerospace sector.",
    "start": "2025-09-22T00:00:00+00:00",
    "end": "2025-09-25T00:00:00+00:00",
    "url": "https://cab.unb.br/",
    "location": "Universidade de Brasilia, UnB - Brasilia, Brasilia, Distrito Federal, 70910-900, Brazil",
    "organizer": "Universidade de Brasilia",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-14 06:58:48+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-14 06:58:48+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2025/01/3rd-Brazilian-Aerospace-Congress-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Congress"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 39,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Congress",
    "timestamp_epoch": 1758499200
  },
  {
    "title": "Dynamo Energy Transition Summit",
    "description": "The Dynamo Energy Transition Summit is a pivotal event in the energy sector, bringing together thought leaders, innovators, and investors to drive forward the global energy transition. Known for its strategic insights and networking potential, this summit is a must-attend for anyone serious about sustainable energy solutions and partnerships. \nMain topics or themes covered: \n\nCorporate Climate Strategies\nClimate Tech Innovations\nInvestment in Energy Transition\nCommercial Partnerships\nStrategic Capital Connections\n\nTarget audience:This event is designed for corporate leaders, climate tech entrepreneurs, investors, and industry stakeholders looking to engage in the energy transition sector. \nDon’t miss the chance to connect with key players and catalyze your role in the energy transition at this prestigious event. \nKeywords: energy transition, climate tech, corporate partnerships, investment, sustainable energy",
    "start": "2025-09-23T00:00:00+00:00",
    "end": "2025-09-24T00:00:00+00:00",
    "url": "https://www.dynamoenergyhub.com/events/dynamo-energy-transition-summit-new-york-climate-week-2025/",
    "location": "New York City Center, New York, United States",
    "organizer": "Dynamo Energy",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:57:11+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 03:17:04+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://bigevent.io/wp-content/uploads/2024/05/cropped-Logo-Big-Event-Full-Blue-White-e1751319841221.png",
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Climate Tech",
      "Investment",
      "New York",
      "North America",
      "Renewable Energy",
      "Sustainability",
      "United States"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Tuesday",
    "iso_week": 39,
    "all_day": true,
    "duration_hours": 24.0,
    "category_string": "Climate Tech, Investment, New York, North America, Renewable Energy, Sustainability, United States",
    "timestamp_epoch": 1758585600
  },
  {
    "title": "Aerospace Additive Manufacturing Summit",
    "description": "About Aerospace Additive Manufacturing Summit 2025\nEuropean’s largest additive manufacturing summit event dedicated to aerospace! AAMS returns to the MEETT in Toulouse September 23-24, 2025 and provides a convenient one-stop shop venue where you can meet with world-class suppliers,see the latest industry products and developments, find the tools to improve productivity, and increase profits. We strongly believe in the power of in-person events to discover, educate, and motivate the additive manufacturing industry. \nMeet & Greet\nMeet the industry thought leaders at the conference & workshops \nNetwork\nConnect & network with the technology & solution providers to upgrade with the latest technologies \nShowcase\nShowcase of the state-of-the-art technologies leading the future of the additive technology in aerospace. \nWhy should you attend AAMS 2025?\nThe Aerospace Additive Manufacturing Summit 2025 will gather industry leaders, subject matter experts and academicians to gain insights on the latest developments of additive technology and new challenges in the aerospace supply chain. \nWe curate sessions with industrial partners to facilitate the attendees with quality learning, knowledge sharing, and networking opportunities. We believe in providing firsthand insights and best-case studies to industry professionals, who are seeking to learn & understand the successful approach & solutions to their challenges. \nAs a delegate this is where you’ll see the advanced manufacturing solutions that bring new levels of productivity and efficiency to your operations. You will get an exclusive chance to ask your questions and network with experts one-to-one in our multiple networking platforms, strategically designed to provide all participants a wide learning experience throughout the event. \nWho should attend the Additive Manufacturing Summit 2025?\nType of business\nAircraft & Aerospace / Automotive / Consulting/Engineering / Defense / Electronics/Computers / Research & Development Centers \nJob Functions\nOwner / Company Management / Corporate Executive / Sales and Marketing / Product Design and Development / Design Engineer / Manufacturing Engineering / Production / Manufacturing Management / Purchasing / Procurement… \nFeatured Technologies\nAdditive Manufacturing / 3D Printing / Advanced Materials / 3D Imaging/Scanning / Design for Additive Manufacturing / CAD/CAM / Plastics/Polymers / Automation / Laser Sintering / Metals / Product Design & Engineering / Post-Processing / 3D Printed Electronics / Composites / Lasers / Rapid Tooling / Metal Deposition / Hybrid Additive Manufacturing Machines \nThe Aerospace Additive Manufacturing Summit 2025 will be hosted at MEETT, near Blagnac International Airport in Toulouse, France, 23-24 September 2025",
    "start": "2025-09-23T00:00:00+00:00",
    "end": "2025-09-25T00:00:00+00:00",
    "url": "https://france.additive-aerospace-summit.com/",
    "location": "MEETT, Concorde Avenue, Aussonne, 31840, France",
    "organizer": "BCI Aerospace",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-12-21 09:40:13+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2024-12-21 09:40:13+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "https://www.spaceagenda.com/wp-content/uploads/2024/12/Aerospace-Additive-Manufacturing-Summit-2025.webp",
    "source_url": "https://www.spaceagenda.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Conference",
      "Exhibition"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Tuesday",
    "iso_week": 39,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Conference, Exhibition",
    "timestamp_epoch": 1758585600
  },
  {
    "title": "International Astronautical Congress (IAC) 2025",
    "description": "The 76th International Astronautical Congress in Sydney, Australia, from 29 September – 3 October 2025, will see the world’s space community gather to access the latest advancements and trends, academic works, industry connections and partnership opportunities. \nCo-exhibit alongside the UK Space Agency \nThe UK Space Agency will have a pavilion to represent the UK space industry, and it is inviting four partners to join it as co-exhibitors. As part of the expression of interest process, applicants must demonstrate how their presence will help promote the UK’s role as a leading spacefaring nation and position as Europe’s leading destination for space activities. The responses will be assessed against the UK Space Agency’s priorities, especially in the Asia-Pacific region. The four highest scoring applicants will be chosen by 13 June and invited to participate on the UK Space Agency stand at IAC 2025. To express an interest in co-exhibiting, please complete the Expression of Interest form by 23:59 on Friday 6 June.",
    "start": "2025-09-29T00:00:00+00:00",
    "end": "2025-10-04T00:00:00+00:00",
    "url": "https://www.iac2025.org",
    "location": "International Convention Centre Sydney, 14 Darling Drive, Sydney, New South Wales",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2024-01-16 12:36:42+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-05-20 07:38:16+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHdpZHRoPSIxMjgwIiBoZWlnaHQ9IjcyMCIgdmlld0JveD0iMCAwIDEyODAgNzIwIj48cmVjdCB3aWR0aD0iMTAwJSIgaGVpZ2h0PSIxMDAlIiBzdHlsZT0iZmlsbDojY2ZkNGRiO2ZpbGwtb3BhY2l0eTogMC4xOyIvPjwvc3ZnPg==",
    "source_url": "https://www.ukspace.org/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Industry events"
    ],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 40,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Industry events",
    "timestamp_epoch": 1759104000
  },
  {
    "title": "IAC 2025",
    "description": "The 76th International Astronautical Congress (IAC) is coming to Sydney, Australia and the countdown has begun!This prestigious event is where the world’s space community gathers to access the latest advancements and trends, academic works, industry connections, and partnership opportunities.IAC 2025 in Sydney, Australia is hosted by Space Industry Association of Australia (SIAA) and co-hosted by Australian Space Agency and NSW Government.This will be the third time Australia has hosted the IAC, with previous events held in Melbourne in 1998 and Adelaide in 2017. The 76th IAC in Sydney in 2025 presents a generational opportunity to showcase the rapid progress of Australia’s space industry and the importance of space-enabled services to the Australian way of life. The event will highlight Australia’s commitment to learning from indigenous knowledges and collaborating with First Nations communities on the deployment and use of space technologies.The event will broaden the influence and relevance of space to adjacent industries, including emergency services, health, utilities, telecommunications, resources, manufacturing, finance, construction, agriculture, and Smart Cities. It will delve into why space is critical for both businesses and our everyday lives.IAC 2025 aims to advance space in the Indo-Pacific by showcasing the entire region and its wide variety of space-based opportunities.",
    "start": "2025-09-29T12:00:00+00:00",
    "end": "2025-10-03T21:00:00+00:00",
    "url": "https://spacenews.com/event/iac-2025/",
    "location": "ICC Sydney, 14 Darling Drive, Sydney, NSW, 2000, Australia",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-17 16:08:48+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-17 16:08:54+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 40,
    "all_day": false,
    "duration_hours": 105.0,
    "category_string": "",
    "timestamp_epoch": 1759147200
  },
  {
    "title": "The 76th International Astronautical Congress (IAC 2025)",
    "description": "The 76th International Astronautical Congress (IAC), the biggest global space event, will be held in Sydney, Australia from 29 September to 3 October 2025. IAC 2025 is organized by the International Astronautical Federation (IAF), hosted by Space Industry Association of Australia (SIAA) and co-hosted by Australian Space Agency and NSW Government. \n\n\n\nThe theme of IAC Sydney 2025 is “Sustainable Space: Resilient Earth” which will set the stage for important discussions such as: space-based application for earth; sustainable space activities; and sustaining life off earth. Key focus areas include showcasing the Asia Pacific region, inspiring and engaging the next generation’s space workforce, engaging a broad range of industries, and educating the community about ‘why space matters’ through the IAC’s open day.",
    "start": "2025-09-29T12:00:00+00:00",
    "end": "2025-10-03T21:00:00+00:00",
    "url": "https://spacenews.com/event/the-76th-international-astronautical-congress-iac-2025/",
    "location": "International Convention Centre Sydney (ICC Sydney), 14 Darling Drive, Sydney, NSW, 2000, Australia",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-04-15 16:32:42+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-04-15 16:32:48+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "September",
    "day_of_week": "Monday",
    "iso_week": 40,
    "all_day": false,
    "duration_hours": 105.0,
    "category_string": "",
    "timestamp_epoch": 1759147200
  },
  {
    "title": "Climate Technology Show",
    "description": "The Climate Technology Show stands at the forefront of the environmental innovation industry, recognized for its pivotal role in driving sustainable advancements and fostering global dialogue. This conference is a beacon for leaders and innovators, bringing together a diverse array of stakeholders committed to addressing climate change through technology and collaboration. \nMain topics or themes covered: \n\nRenewable Energy Solutions\nCarbon Capture Technologies\nClimate Policy and Regulation\nGreen Infrastructure and Urban Planning\nSustainable Agriculture Practices\n\nTarget audience:The event is tailored for environmental scientists, policymakers, technology developers, business leaders, and sustainability advocates, all dedicated to creating a resilient, sustainable future. \nDon’t miss the opportunity to engage with cutting-edge innovators and thought leaders at the Climate Technology Show, where groundbreaking ideas and strategic partnerships are forged, shaping the future of our planet. \nKeywords: climate change, sustainability, renewable energy, green technology, environmental innovation",
    "start": "2025-10-01T00:00:00+00:00",
    "end": "2025-10-03T00:00:00+00:00",
    "url": "https://climatetechshow.com/",
    "location": "Excel London, Royal Victoria Dock, 1 Western Gateway, London, E16 1XL, United Kingdom",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:07:10+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:28:36+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Climate Tech",
      "Europe",
      "London",
      "London Tech",
      "Sustainability",
      "Tech",
      "United Kingdom"
    ],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Wednesday",
    "iso_week": 40,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Climate Tech, Europe, London, London Tech, Sustainability, Tech, United Kingdom",
    "timestamp_epoch": 1759276800
  },
  {
    "title": "Space Suppliers Summit Chennai",
    "description": "Space Suppliers Summit Chennai is an exclusive B2B event bringing together global and Indian space-tech companies, suppliers, OEMs and innovators under one roof. From satellites to spacecraft subsystems, this summit is where space infrastructure meets supply chain excellence. \nIt includes: \n\nHigh-Level Conferences – Gain first-hand knowledge from industry leaders, space agency officials and engineering pioneers. Learn about the latest trends, technological breakthroughs, and policy frameworks shaping the future of space infrastructure.\nPre-Arranged B2B Meetings – Connect directly with decision-makers from global OEMs, Tier-1 suppliers and government agencies through targeted, one-on-one business meetings. Every conversation is curated to match your interests and capabilities.\n­Exhibition – Showcase your products, technologies and services in a dedicated exhibition zone designed to attract buyers, collaborators and investors interested in cutting-edge space solutions.\n\nThis event takes place alongside Aerospace & Defence Meetings Chennai 2025.",
    "start": "2025-10-07T00:00:00+00:00",
    "end": "2025-10-10T00:00:00+00:00",
    "url": "https://chennai.bciaerospace.com/space-suppliers-summit-chennai",
    "location": "Chennai Trade Centre, CTC Complex, Nandambakkam, Chennai, Tamil Nadu, 600089, India",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-05-20 05:47:37+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-05-20 05:47:37+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://www.ukspace.org/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Industry events"
    ],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Tuesday",
    "iso_week": 41,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Industry events",
    "timestamp_epoch": 1759795200
  },
  {
    "title": "7th Summit for Space Sustainability",
    "description": "The 7th Summit for Space Sustainability is a high-level, multi-day event focused on developing solutions for space sustainability, hosted by the Secure World Foundation, CNES and the Government of France, to be held on 22-23 October 2025 at the Centre de Conférences Pierre Mendès France in Paris. \nThe summit will be a unique gathering of global stakeholders from government, industry and civil society, and will feature keynotes, interactive sessions, panels and networking designed to highlight opportunities and challenges for developing solutions for space sustainability. \nFurther information",
    "start": "2025-10-22T00:00:00+00:00",
    "end": "2025-10-24T00:00:00+00:00",
    "url": "https://swfsummit.org/",
    "location": "Centre de Conférences Pierre Mendès France, Paris, France",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2022-04-12 15:24:15+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-05-01 21:06:57+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://www.ukspace.org/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Industry events"
    ],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Wednesday",
    "iso_week": 43,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Industry events",
    "timestamp_epoch": 1761091200
  },
  {
    "title": "The 7th Summit for Space Sustainability",
    "description": "The 7th Summit for Space Sustainability, co-hosted by the Secure World Foundation, the Centre National D’études Spatiales (CNES), and the Government of France, is a high-level, multi-day international forum focused on advancing solutions for the long-term sustainability of space activities. \n\n\n\nThrough a mix of keynotes, panels, and spotlight talks, key themes this conference will address include policy updates on key initiatives for space sustainability; impacts of space activities on the atmosphere; viewpoints on space security and stability; contribution of space applications to sustainability challenges on Earth; and the role – and viability – of commercial space sustainability services as part of the space economy.",
    "start": "2025-10-22T12:00:00+00:00",
    "end": "2025-10-23T21:00:00+00:00",
    "url": "https://spacenews.com/event/the-7th-summit-for-space-sustainability/",
    "location": "Centre de Conférences Pierre Mendès, 139 Rue de Bercy, Paris, 75012, France",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-05-09 15:51:06+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-05-09 15:51:09+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Wednesday",
    "iso_week": 43,
    "all_day": false,
    "duration_hours": 33.0,
    "category_string": "",
    "timestamp_epoch": 1761134400
  },
  {
    "title": "Reinventing Space Conference 2025",
    "description": "Organised by the British Interplanetary Society, the Reinventing Space Conference brings together a network of innovators from industry, agency, government, financiers, academia and end users to present and discuss the key challenges and opportunities for future space leadership and growth. \nBooking is open now, with a 10% Early Bird Discount before 15 August 2025.",
    "start": "2025-10-27T00:00:00+00:00",
    "end": "2025-10-30T00:00:00+00:00",
    "url": "https://www.bis-space.com/reinventingspace",
    "location": "Royal Aeronautical Society, 4 Hamilton Place, London , W1J 7BQ, United Kingdom",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-06-19 11:16:06+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-06-19 11:16:06+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://www.ukspace.org/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Monday",
    "iso_week": 44,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "",
    "timestamp_epoch": 1761523200
  },
  {
    "title": "VERGE",
    "description": "VERGE is a transformative conference that stands at the forefront of sustainable innovation, bringing together forward-thinking corporate leaders, NGOs, service providers, startups, and investors committed to creating a profitable and sustainable future. As part of the Trellis Impact 25, VERGE offers attendees the unique opportunity to participate in three leading events simultaneously, fostering comprehensive strategies that bridge climate and nature with sustainable finance. \nMain topics or themes covered: \n\nCarbon Accounting, Removal and Credits\nDeploying Clean Energy\nDecarbonizing Heavy Industry\nNext-Gen Transport\nStartups & Innovation\n\nTarget audience:This event serves professionals decarbonizing and future-proofing their organizations, including clean energy buyers, service providers, and energy providers seeking to accelerate the transition to a carbon-free energy future. \nJoin VERGE to gain deep insights into industry futures, navigate changing policies, and build robust networks that drive collaborative innovation. \nKeywords: sustainability, clean energy, decarbonization, innovation, Trellis Impact 25",
    "start": "2025-10-28T00:00:00+00:00",
    "end": "2025-10-31T00:00:00+00:00",
    "url": "https://trellis.net/events/verge/",
    "location": "San Jose Convention Center, 150 W San Carlos St, San Jose, California, 95113, United States",
    "organizer": "Trellis",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 02:18:34+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 03:18:58+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "California",
      "Climate Tech",
      "North America",
      "San Jose",
      "San Jose Tech",
      "Sustainability",
      "Tech",
      "United States"
    ],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Tuesday",
    "iso_week": 44,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "California, Climate Tech, North America, San Jose, San Jose Tech, Sustainability, Tech, United States",
    "timestamp_epoch": 1761609600
  },
  {
    "title": "19th ESPI Autumn Conference: Europe as a Space Power - Directionality & Priorities of Strategic Action",
    "description": "The Autumn Conference is one of the annual highlights of ESPI’s calendar, offering a platform for European and international stakeholders to convene and hold informed and in-depth space-related discussions that reach beyond headlines. ​The 19th edition of the ESPI Autumn Conference will address the pathways for Europe to become a full-fledged space power and reinforce its role as a partner to the world, bringing together high-level European and international stakeholders.",
    "start": "2025-10-28T12:00:00+00:00",
    "end": "2025-10-29T21:00:00+00:00",
    "url": "https://spacenews.com/event/19th-espi-autumn-conference-europe-as-a-space-power-directionality-priorities-of-strategic-action/",
    "location": "Vienna Rathaus, Friedrich-Schmidt-Platz 1, Vienna, 1010, Austria",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-03-13 01:29:50+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-03-13 01:29:53+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Tuesday",
    "iso_week": 44,
    "all_day": false,
    "duration_hours": 33.0,
    "category_string": "",
    "timestamp_epoch": 1761652800
  },
  {
    "title": "Silicon Valley Space Week (SVSW)",
    "description": "SVSW is where the space industry’s most influential voices come together. From C-level executives and military leadership to key decision-makers across commercial and government sectors, SVSW offers rare access to the people and conversations shaping the future of space.Whether you’re an industry professional, a curious innovator, or someone passionate about what’s ahead, this is your opportunity to gain insights and make connections that aren’t possible anywhere else.",
    "start": "2025-10-28T12:00:00+00:00",
    "end": "2025-10-30T21:00:00+00:00",
    "url": "https://spacenews.com/event/silicon-valley-space-week-svsw/",
    "location": "Computer History Museum, 1401 N Shoreline Blvd., Mountain View, CA, 94043, United States",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-29 13:39:59+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-07-29 13:40:01+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "October",
    "day_of_week": "Tuesday",
    "iso_week": 44,
    "all_day": false,
    "duration_hours": 57.0,
    "category_string": "",
    "timestamp_epoch": 1761652800
  },
  {
    "title": "SOSV Climate Tech Summit",
    "description": "The SOSV Climate Tech Summit is a pivotal event in the climate technology sector, renowned for its role in advancing innovation and collaboration. As a key platform in the industry, it unites thought leaders, innovators, and decision-makers to address and strategize solutions for the pressing climate challenges we face today. \nMain topics or themes covered: \n\nDecarbonization Strategies\nEnergy Innovations\nClimate Policy and Impact\nSustainable Transport Solutions\nAdvancements in Industrial Materials\n\nTarget audience:This event is designed for climate tech startup founders, venture capitalists, corporate leaders, policymakers, technologists, and media professionals who are committed to driving sustainability and innovation. \nEvent highlights:– Over 1,500 matchmaking meetings conducted pre-Summit– Keynote speakers from leading companies like TerraPower and Fervo Energy– Unique VC-Founder Matchup program– Engaging panels and breakout sessions– Hosted virtually for global accessibility \nSeize the opportunity to be part of a transformative event that is shaping the future of climate technology and sustainability. \nKeywords: climate tech, sustainability, innovation, decarbonization, startups",
    "start": "2025-11-03T00:00:00+00:00",
    "end": "2025-11-08T00:00:00+00:00",
    "url": "https://sosvclimatetech.com/",
    "location": "",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 02:14:34+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 03:18:58+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Climate Tech",
      "Online",
      "Startup",
      "Sustainability",
      "Tech"
    ],
    "year": 2025,
    "month_name": "November",
    "day_of_week": "Monday",
    "iso_week": 45,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Climate Tech, Online, Startup, Sustainability, Tech",
    "timestamp_epoch": 1762128000
  },
  {
    "title": "EmTech MIT",
    "description": "EmTech MIT is the definitive event for those navigating the future of technology and innovation. Recognized for over 25 years as a beacon for senior executives, researchers, and entrepreneurs, EmTech MIT, curated by MIT Technology Review, is where clarity meets insight, equipping leaders to face uncertainty with confidence. \nMain topics or themes covered: \n\nArtificial Intelligence\nClimate Technology\nQuantum Computing\nRobotics\nDigital Trust and Decentralized Systems\n\nTarget audience:This event is designed for accomplished and emerging leaders in sectors such as strategy, product development, engineering, data science, and research & development, including CIOs, CTOs, CEOs, founders, and directors. \nEvent highlights:– Engage with MIT Technology Review’s expert editorial team– Participate in discussions with cross-industry experts– Experience the innovation playground of the MIT campus– Network with decision-makers and change agents– Be part of a legacy of world-changing innovations \nSeize the opportunity to shape the future in an environment that challenges and inspires, surrounded by the brightest minds in technology and innovation. \nKeywords: EmTech MIT, technology, innovation, AI, MIT campus",
    "start": "2025-11-04T00:00:00+00:00",
    "end": "2025-11-07T00:00:00+00:00",
    "url": "https://event.technologyreview.com/emtech-mit-2025",
    "location": "MIT Campus, 77 Massachusetts Avenue, Cambridge, Massachusetts, 2139, United States",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 02:22:04+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:38:51+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "AI",
      "Cambridge",
      "Climate Tech",
      "Massachusetts",
      "North America",
      "Quantum Computing",
      "Robotics",
      "Tech",
      "United States"
    ],
    "year": 2025,
    "month_name": "November",
    "day_of_week": "Tuesday",
    "iso_week": 45,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "AI, Cambridge, Climate Tech, Massachusetts, North America, Quantum Computing, Robotics, Tech, United States",
    "timestamp_epoch": 1762214400
  },
  {
    "title": "APSCC 2025",
    "description": "Bringing Together Space \n\n\n\nJoin us from November 4 to 6, 2025 in Taipei, Taiwan for the 26th annual APSCC — the premier gathering of the Asia-Pacific satellite and space community. This three-day event brings together professionals to gain market insights, forge partnerships, and facilitate business deals.",
    "start": "2025-11-04T13:00:00+00:00",
    "end": "2025-11-06T22:00:00+00:00",
    "url": "https://spacenews.com/event/apscc-2025/",
    "location": "Marriott Taipei Taiwan, No. 199號, Lequn 2nd Rd, Zhongshan District, Taipei City, 10491, Taiwan",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-03-20 03:34:53+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-03-20 03:34:57+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "November",
    "day_of_week": "Tuesday",
    "iso_week": 45,
    "all_day": false,
    "duration_hours": 57.0,
    "category_string": "",
    "timestamp_epoch": 1762261200
  },
  {
    "title": "Space Tech Expo Europe",
    "description": "Join us at Europe’s largest B2B Space event, the premier gathering for space professionals across the continent. Get ready to ignite your network, engage with top industry players, and discover the latest advancements in one convenient location. Join us for an unparalleled opportunity to elevate your expertise and forge meaningful connections in the dynamic world of space technology.",
    "start": "2025-11-18T13:00:00+00:00",
    "end": "2025-11-20T22:00:00+00:00",
    "url": "https://spacenews.com/event/space-tech-expo-europe/",
    "location": "Congress Bremen, Findorffstrasse 101, Bremen, 28215",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-03-16 23:43:13+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-03-16 23:43:16+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "November",
    "day_of_week": "Tuesday",
    "iso_week": 47,
    "all_day": false,
    "duration_hours": 57.0,
    "category_string": "",
    "timestamp_epoch": 1763470800
  },
  {
    "title": "LATSAT 2025",
    "description": "Gathering Latin America’s Space Industry LeadersReturning for its 7th edition, LATSAT is Latin America’s premier space conference, co-hosted by Novaspace and the Colombian Space Agency. Taking place in Bogotá, Colombia, from November 19-20, 2025, the event will gather 300+ senior leaders from the satellite communications, connectivity, and Earth observation sectors to explore opportunities and drive innovation in the region.LATSAT 2025 Highlights– 40+ Executive-Level Speakers– 300+ Senior Decision-Makers– 20+ Sponsors & Partners– 20+ Countries RepresentedDate: November 19–20, 2025Venue: Hall 74 Event Center | Bogota, ColombiaSecure Your Spot Now: Register Today!Join the leaders shaping the future of Latin America’s space industry!",
    "start": "2025-11-19T13:00:00+00:00",
    "end": "2025-11-20T22:00:00+00:00",
    "url": "https://spacenews.com/event/latsat-2025/",
    "location": "Hall 74 Event Center, Bogota | Colombia, Cl. 74 #14 - 25, Bogota, 75008, Colombia",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-01-30 22:34:35+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-01-30 22:34:39+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "November",
    "day_of_week": "Wednesday",
    "iso_week": 47,
    "all_day": false,
    "duration_hours": 33.0,
    "category_string": "",
    "timestamp_epoch": 1763557200
  },
  {
    "title": "In2Space Forum",
    "description": "The Platform for Innovative Space and Satellite Capabilities and Applications for Land, Sea and Air.Exploring Terrestrial Innovation Through Satellite TechnologyIn2Space is an innovative conference dedicated to showcasing the vast terrestrial applications enabled by satellite-based remote sensing, navigation, and telecommunications. Hosted in the heart of Riyadh, KSA, this premier event offers a unique platform for satellite developers, technology providers, and end-users to connect, collaborate, and drive innovation across industries.About the Conference:In2Space brings together global and regional leaders from both traditional and emerging space sectors, along with experts in ground-based satellite infrastructure. The conference will feature insightful presentations, interactive workshops, and a dynamic exhibition showcasing the latest advancements across the entire satellite ecosystem.In2Space is designed to empower decision-makers from regional government entities with a vested interest in advancing the space sector — including space agencies, technology providers, and application developers. The conference will serve as a strategic platform to explore how to build a sustainable and economically viable regional space ecosystem that attracts established international companies while nurturing the growth of innovative startups.Technical Workshops: Engage in topic-specific workshop sessions that connect upstream satellite developers with downstream users of satellite data. These workshops are designed to: Identify gaps in existing satellite data and services Inspire next-generation satellite concepts Develop top-level requirements for future missions \n\n\n\nEach session will be moderated by subject matter experts, who will summarise key findings and outline recommendations based on the discussions.AI & Data Fusion Roundtables : Explore cutting-edge approaches to satellite data processing and management. Roundtable discussions will focus on: Leveraging AI for multi-source data fusion Integrating data from diverse satellite platforms and ground-based sensorsAddressing real-world challenges in data volume, speed, and usabilityThese sessions aim to unlock new potential in sectors such as agriculture, urban development, environmental monitoring, and smart infrastructure.Technology Exhibition: Discover the latest advancements in both upstream and downstream space technologies. The exhibition will showcase products and services from satellite manufacturers, infrastructure providers, analytics platforms, and data users. \n\n\n\nEvent DescriptionStart DateEnd DateYour NameRana TahtamoniOrganizer NameEjtemaat KSAEvent Websitehttps://in2space.me/Event Cost1359Event Location NameRiyadh, Kingdom of Saudi ArabiaEvent Location AddressRiyadh, Kingdom of Saudi ArabiaJarir St, Al Malaz, Riyadh, P.O. Box 41316 Postal Code: 11521Riyadh, Kingdom of Saudi Arabia P.O. Box 41316Saudi ArabiaMap ItEvent ImageWeb-Banner-1600×650-In2Space.pngYour Email Addressrana.t@ejtemaat.com",
    "start": "2025-11-24T13:00:00+00:00",
    "end": "2025-11-25T22:00:00+00:00",
    "url": "https://spacenews.com/event/in2space-forum/",
    "location": "Riyadh, Kingdom of Saudi Arabia, Jarir St, Al Malaz, Riyadh,, Riyadh, 11521",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-03 15:10:07+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-07-03 15:10:11+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://spacenews.com/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [],
    "year": 2025,
    "month_name": "November",
    "day_of_week": "Monday",
    "iso_week": 48,
    "all_day": false,
    "duration_hours": 33.0,
    "category_string": "",
    "timestamp_epoch": 1763989200
  },
  {
    "title": "Impact Investing Conference",
    "description": "The Impact Investing Conference is a pivotal event in the realm of sustainable finance, renowned for its focus on ethical investment practices and its commitment to fostering positive societal impact through capital allocation. As a leader in the industry, it attracts a diverse array of stakeholders, from financial giants to emerging market leaders, all converging to explore and expand the horizons of impact investing. \nMain topics or themes covered: \n\nESG (Environmental, Social, and Governance)\nBlended Finance\nClimate Finance\nImpact Funds\nSustainable Investing\n\nTarget audience:This conference serves a wide spectrum of professionals, including investment bankers, asset managers, policymakers, philanthropists, and corporate leaders seeking to align financial returns with positive societal outcomes. \nJoin us at the Impact Investing Conference to gain unprecedented insights from industry leaders like Goldman Sachs and HSBC, engage with key players from the EU and EIB, and explore cutting-edge strategies in ESG and sustainable finance. \nKeywords: impact investing, ESG, sustainable finance, climate finance, London conference",
    "start": "2025-12-04T00:00:00+00:00",
    "end": "2025-12-06T00:00:00+00:00",
    "url": "https://impactinvestingconferences.com/",
    "location": "Kensington Conference and Event Centre, Hornton Street, Kensington, London, London, W8 7NX, United Kingdom",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 02:04:19+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 03:45:38+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Climate Tech",
      "Europe",
      "Finance",
      "Investment",
      "London",
      "London Finance",
      "Sustainability",
      "United Kingdom"
    ],
    "year": 2025,
    "month_name": "December",
    "day_of_week": "Thursday",
    "iso_week": 49,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Climate Tech, Europe, Finance, Investment, London, London Finance, Sustainability, United Kingdom",
    "timestamp_epoch": 1764806400
  },
  {
    "title": "PLANETech World",
    "description": "PLANETech World is a premier global climate tech conference, renowned for its pivotal role in uniting climate innovation with technological advancements in Israel. This influential event offers unparalleled opportunities for attendees to explore groundbreaking technologies and insights within the climate tech ecosystem. \nMain topics or themes covered: \n\nEnergy Innovation\nWater Management\nInfrastructure & Industry\nFood-Tech Developments\nAI & Digital Solutions\n\nTarget audience:This event caters to climate leaders, entrepreneurs, investors, policymakers, and academics dedicated to scaling a thriving economy through technological solutions to climate challenges. \nEvent highlights:– A major conference in Tel Aviv– Diverse thematic tracks exploring cutting-edge technologies– High-value networking opportunities across Israel– Ecosystem tours and private events– A week-long celebration of climate innovation \nDon’t miss the chance to be part of PLANETech World, where the global climate impact is shaped by the brightest minds and the most promising startups in the industry. \nKeywords: climate tech, innovation, technology, Israel, sustainability",
    "start": "2025-12-09T00:00:00+00:00",
    "end": "2025-12-10T00:00:00+00:00",
    "url": "https://www.planetechworld.org/",
    "location": "Rabin Center, 8 Haim Levanon Street, Tel Aviv, 6997508, Israel",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 02:10:34+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 03:18:58+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Asia",
      "Climate Tech",
      "Innovation",
      "Israel",
      "Sustainability",
      "Tech",
      "Tel Aviv"
    ],
    "year": 2025,
    "month_name": "December",
    "day_of_week": "Tuesday",
    "iso_week": 50,
    "all_day": true,
    "duration_hours": 24.0,
    "category_string": "Asia, Climate Tech, Innovation, Israel, Sustainability, Tech, Tel Aviv",
    "timestamp_epoch": 1765238400
  },
  {
    "title": "CES",
    "description": "CES is the world’s most influential tech event, renowned for its ability to bring together the brightest minds and most impactful brands in the tech industry. As a global platform for innovation and collaboration, CES showcases transformative technologies that redefine how we live and work, offering unparalleled opportunities for networking and discovery. \nMain topics or themes covered: \n\nInnovative Tech Solutions\nBusiness Development\nGlobal Partnerships\nImmersive Activations\nBreakthrough Technologies\n\nTarget audience:This event serves a diverse range of professionals, including tech innovators, business leaders, industry influencers, government officials, and media representatives, all eager to explore the latest advancements and forge meaningful connections. \nEvent highlights:– Over 142,000 attendees– 1,400 startups within Eureka Park– More than 4,500 exhibitors– Unique activations and demos– Recognized globally for pioneering innovation \nDon’t miss the chance to be part of CES, where the future of technology and innovation is unveiled, offering a gateway to the next wave of global advancements. \nKeywords: technology, innovation, networking, global brands, CES",
    "start": "2026-01-06T00:00:00+00:00",
    "end": "2026-01-10T00:00:00+00:00",
    "url": "https://www.ces.tech/",
    "location": "The Venetian, 3355 Las Vegas Blvd S, Las Vegas, NV, 89109, United States",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 00:54:31+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:23:50+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "3D Printing",
      "AR/VR/XR",
      "Business",
      "Climate Tech",
      "Innovation",
      "Las Vegas",
      "Las Vegas Business",
      "Las Vegas Tech",
      "MedTech",
      "Nevada",
      "North America",
      "Tech",
      "United States"
    ],
    "year": 2026,
    "month_name": "January",
    "day_of_week": "Tuesday",
    "iso_week": 2,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "3D Printing, AR/VR/XR, Business, Climate Tech, Innovation, Las Vegas, Las Vegas Business, Las Vegas Tech, MedTech, Nevada, North America, Tech, United States",
    "timestamp_epoch": 1767657600
  },
  {
    "title": "World Future Energy Summit",
    "description": "The World Future Energy Summit is a pivotal event in the clean energy sector, known for its role as a catalyst in the global transition to sustainable energy. As the leading event of its kind, it serves as a hub for industry leaders, policymakers, investors, and innovators to come together and shape a greener future. \nMain topics or themes covered: \n\nClean Energy Solutions\nInvestment Opportunities in Renewable Energy\nSustainable Development Practices\nTechnological Innovations in Energy\nPolicy and Regulation in Energy Sector\n\nTarget audience:This event is designed for a diverse audience, including energy industry leaders, policymakers, corporate partners, start-ups, and investors looking to collaborate on sustainable energy initiatives. \nEvent highlights:– Thousands of participants from across the globe– Keynote speakers from top energy companies and governmental bodies– Numerous exhibitors showcasing cutting-edge energy solutions– Interactive zones for innovative prototypes and technology showcases– Recognized for its commitment to sustainability and reducing carbon footprint \nJoin the World Future Energy Summit to be at the forefront of the energy transition and make meaningful connections that drive change. \nKeywords: energy summit, clean energy, renewable energy, sustainability, innovation",
    "start": "2026-01-13T00:00:00+00:00",
    "end": "2026-01-16T00:00:00+00:00",
    "url": "https://www.worldfutureenergysummit.com/",
    "location": "ADNEC Centre, Khaleej Al Arabi Street, Abu Dhabi, 5546, United Arab Emirates",
    "organizer": "RELX",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:05:15+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:23:20+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Abu Dhabi",
      "Abu Dhabi Tech",
      "Asia",
      "Business",
      "Climate Tech",
      "Renewable Energy",
      "Sustainability",
      "Tech",
      "United Arab Emirates"
    ],
    "year": 2026,
    "month_name": "January",
    "day_of_week": "Tuesday",
    "iso_week": 3,
    "all_day": true,
    "duration_hours": 72.0,
    "category_string": "Abu Dhabi, Abu Dhabi Tech, Asia, Business, Climate Tech, Renewable Energy, Sustainability, Tech, United Arab Emirates",
    "timestamp_epoch": 1768262400
  },
  {
    "title": "Space Suppliers Summit 2026",
    "description": "The Space Suppliers Summit will take place in Glasgow in 2026. It is a premier international business convention bringing together global leaders in space manufacturing and upstream innovation. \nHeld in one of Europe’s fastest-growing space hubs, the event will provide: \n\nHigh-level presentations by key industry leaders\nTargeted B2B meetings with buyers, suppliers and start-ups\nA unique opportunity to connect, collaborate and drive your business forward",
    "start": "2026-02-03T00:00:00+00:00",
    "end": "2026-02-05T00:00:00+00:00",
    "url": "https://space-meetings.com",
    "location": "Technology & Innovation Centre, University of Strathclyde, 99 George Street, Glasgow, G1 1RD, United Kingdom",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2023-02-20 18:42:40+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-05-12 11:29:00+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://www.ukspace.org/?post_type=tribe_events&ical=1&eventDisplay=list",
    "categories": [
      "Industry events"
    ],
    "year": 2026,
    "month_name": "February",
    "day_of_week": "Tuesday",
    "iso_week": 6,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Industry events",
    "timestamp_epoch": 1770076800
  },
  {
    "title": "Climate Investor Forum",
    "description": "The Climate Investor Forum is a pivotal event in the realm of climate finance and investment, recognized for its influence and capacity to shape the future of sustainable development. As a preeminent gathering, it serves as a catalyst for innovation and collaboration among leading investors, corporate leaders, and government agencies, all committed to advancing climate solutions and green initiatives. \nMain topics or themes covered: \n\nClean and Renewable Energy Transition\nNature-Based Solutions\nClimate Smart and Regenerative Agriculture\nDecarbonization of Mineral Supply Chains\nCircular Economy and Climate Tech\n\nTarget audience:This event is tailored for investors, corporate executives, government funding agencies, climate technology innovators, and sustainability professionals seeking to drive impactful change and foster sustainable growth. \nEvent highlights:– Over 1,000 anticipated participants– Renowned keynote speakers from leading climate organizations– Diverse exhibitors showcasing cutting-edge climate solutions– Unique networking zones for direct commercial interaction– Recognized as a leading event for climate finance in the Asia-Pacific region \nJoin us at the Climate Investor Forum to be part of a transformative experience that empowers you to connect with industry leaders, explore groundbreaking solutions, and contribute to a sustainable future. \nKeywords: climate finance, renewable energy, sustainable investment, green technology, carbon sequestration",
    "start": "2026-02-17T00:00:00+00:00",
    "end": "2026-02-19T00:00:00+00:00",
    "url": "https://climateinvestorforum.com/",
    "location": "Melbourne City Center, Melbourne, Australia",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:39:14+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 03:17:04+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Australia",
      "Climate Change",
      "Climate Tech",
      "Finance",
      "Investment",
      "Melbourne",
      "Oceania",
      "Renewable Energy",
      "Sustainability"
    ],
    "year": 2026,
    "month_name": "February",
    "day_of_week": "Tuesday",
    "iso_week": 8,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Australia, Climate Change, Climate Tech, Finance, Investment, Melbourne, Oceania, Renewable Energy, Sustainability",
    "timestamp_epoch": 1771286400
  },
  {
    "title": "Earthx",
    "description": "EarthX is a pioneering global environmental conference renowned for its expansive reach and impactful discussions, attracting leaders from various sectors to shape the future of sustainability. As a driving force in the industry, EarthX fosters collaboration and innovation, providing attendees with unparalleled opportunities to engage with cutting-edge environmental solutions. \nMain topics or themes covered: \n\nSustainable Solutions\nEnvironmental Policy\nClimate Change\nRenewable Energy\nConservation Practices\n\nTarget audience:This event serves a diverse group including environmentalists, conservationists, business leaders, policy makers, academics, students, and NGOs, all dedicated to advancing sustainability worldwide. \nEvent highlights:– Over 177,000 participants in past events– Keynotes by influential business and political leaders– Nearly 400 exhibitors and sponsors– Unique networking opportunities for building coalitions– Global media recognition for impactful environmental advocacy \nJoin EarthX to be at the forefront of environmental innovation, where global leaders converge to inspire action and create a sustainable future for all. \nKeywords: environmental conference, sustainability, climate change, renewable energy, conservation",
    "start": "2026-04-20T00:00:00+00:00",
    "end": "2026-04-25T00:00:00+00:00",
    "url": "https://earthx.org/",
    "location": "Hilton Anatole, 2201 N Stemmons Fwy, Dallas, Texas, 75207, United States",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:05:30+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:02:09+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Climate Change",
      "Climate Tech",
      "Dallas",
      "North America",
      "Renewable Energy",
      "Sustainability",
      "Texas",
      "United States"
    ],
    "year": 2026,
    "month_name": "April",
    "day_of_week": "Monday",
    "iso_week": 17,
    "all_day": true,
    "duration_hours": 120.0,
    "category_string": "Climate Change, Climate Tech, Dallas, North America, Renewable Energy, Sustainability, Texas, United States",
    "timestamp_epoch": 1776643200
  },
  {
    "title": "VivaTech",
    "description": "VivaTech is a leading global conference in the world of technology and innovation, celebrated for its dynamic atmosphere and significant impact on the industry. As a hub for groundbreaking ideas and transformative solutions, it attracts a diverse range of tech enthusiasts, entrepreneurs, and industry leaders from around the world. \nMain topics or themes covered: \n\nTechnology Innovation\nStartup Ecosystems\nInvestment Opportunities\nPartnership Development\nFuture of Tech\n\nTarget audience:This event is tailored for innovators, entrepreneurs, investors, tech companies, and professionals seeking to explore new opportunities and engage with the latest advancements in technology. \nEvent highlights:– 180,000 attendees– Participation from 14,000 startups– Collaboration with 4,000 partners– Engagement of 3,600 investors– Held at Paris Expo Porte de Versailles, a prestigious venue \nSeize the opportunity to be part of VivaTech, where the future of technology unfolds and unparalleled connections are made, driving the industry forward. \nKeywords: technology, innovation, startups, investment, Paris",
    "start": "2026-06-17T00:00:00+00:00",
    "end": "2026-06-21T00:00:00+00:00",
    "url": "https://vivatechnology.com/",
    "location": "Paris Expo Porte de Versailles, 1 Place de la Porte de Versailles, Paris, 75015, France",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-07-25 01:05:09+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:23:50+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Business",
      "Climate Tech",
      "Europe",
      "France",
      "Investment",
      "Paris",
      "Paris Business",
      "Paris Tech",
      "Startup",
      "Tech"
    ],
    "year": 2026,
    "month_name": "June",
    "day_of_week": "Wednesday",
    "iso_week": 25,
    "all_day": true,
    "duration_hours": 96.0,
    "category_string": "Business, Climate Tech, Europe, France, Investment, Paris, Paris Business, Paris Tech, Startup, Tech",
    "timestamp_epoch": 1781654400
  },
  {
    "title": "Reset Connect London",
    "description": "Reset Connect London is a pivotal event in the climate action sector, aligning with London Climate Action Week to bring together the brightest minds and most innovative solutions for sustainability. This flagship conference is recognized for its comprehensive scope and the significant opportunities it offers attendees in terms of learning, networking, and collaboration. \nMain topics or themes covered: \n\nSustainable Innovation\nClimate Policy and Action\nGreen Finance and Investment\nRenewable Energy Solutions\nCorporate Responsibility and Sustainability\n\nTarget audience:This event serves a diverse range of professionals including investors, consultants, vendors, start-ups, scale-ups, students, and journalists, all focused on sustainability and climate action. \nEvent highlights:– Attendance by hundreds of industry experts and thought leaders– More than 400 speakers across 5 stages– Networking opportunities with 300+ suppliers and innovators– VIP experiences with exclusive workshops and events– Comprehensive matchmaking and networking app \nJoin Reset Connect London to be at the forefront of climate action and sustainability, where your participation can make a real difference. \nKeywords: sustainability, climate action, green finance, renewable energy, networking",
    "start": "2026-06-23T00:00:00+00:00",
    "end": "2026-06-25T00:00:00+00:00",
    "url": "https://www.reset-connect.com/bigevent",
    "location": "Excel London, Royal Victoria Dock, 1 Western Gateway, London, E16 1XL, United Kingdom",
    "organizer": "",
    "status": "",
    "recurrence": "",
    "sequence": "",
    "created": "vDDDTypes(2025-08-17 01:37:36+00:00, Parameters({}))",
    "last_modified": "vDDDTypes(2025-08-17 01:37:36+00:00, Parameters({}))",
    "attendees": [],
    "priority": "",
    "image_url": null,
    "source_url": "https://bigevent.io/?post_type=tribe_events&tribe_events_cat=climate-tech&ical=1&eventDisplay=list",
    "categories": [
      "Business",
      "Climate Change",
      "Climate Tech",
      "Europe",
      "London",
      "London Business",
      "Sustainability",
      "United Kingdom"
    ],
    "year": 2026,
    "month_name": "June",
    "day_of_week": "Tuesday",
    "iso_week": 26,
    "all_day": true,
    "duration_hours": 48.0,
    "category_string": "Business, Climate Change, Climate Tech, Europe, London, London Business, Sustainability, United Kingdom",
    "timestamp_epoch": 1782172800
  }
]