[
    {
        "Name": "1% For the Planet",
        "Core Values": "Responsibility, Impact",
        "Organisations": "1% for the Planet",
        "How We Support It": "We support 1% for the Planet by committing a portion of our profits to environmental causes, collaborating with nonprofit organizations, and actively participating in community initiatives that promote sustainability and conservation efforts.",
        "Why We Support It": "We support 1% For the Planet because it encourages businesses and individuals to contribute a portion of their revenue to environmental causes. This initiative fosters a community of like-minded organizations committed to sustainability, helping to protect the planet and promote responsible practices. By participating, we align our values with our actions, ensuring that we contribute positively to environmental conservation efforts.",
        "SDGs": "SDG 01 - No Poverty (https://www.notion.so/SDG-01-No-Poverty-28c8e6d771a440d4a9729b03d8f5658a?pvs=21)",
        "Description": "No content",
        "Committed to": "",
        "CSR": "",
        "URL": ""
    },
    {
        "Name": "A Good Thing",
        "Core Values": "Responsibility, Collaboration",
        "Organisations": "A Good Thing",
        "How We Support It": "We support it by promoting collaboration, fostering open communication, and encouraging innovative thinking within our team. Additionally, we provide resources and training to ensure that all team members understand and embody these core values.",
        "Why We Support It": "We support it because it aligns with our core values and mission, fostering a positive impact on our community and encouraging collaboration and innovation. By embracing this initiative, we can drive meaningful change and create lasting benefits for all stakeholders involved.",
        "SDGs": "SDG 01 - No Poverty (https://www.notion.so/SDG-01-No-Poverty-28c8e6d771a440d4a9729b03d8f5658a?pvs=21)",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Access to Space for All ",
        "Core Values": "",
        "Organisations": "United Nations Office for Outer Space Affairs (https://www.notion.so/United-Nations-Office-for-Outer-Space-Affairs-21bd6625c679813c9507e3aaf38e75ad?pvs=21)",
        "How We Support It": "We support access to space for all by promoting inclusive policies, funding educational programs, and fostering partnerships with organizations dedicated to democratizing space exploration. Our initiatives aim to provide resources and opportunities for underrepresented communities to engage in space-related activities and careers.",
        "Why We Support It": "We support \"Access to Space for All\" because it aims to democratize space exploration and make it accessible to a wider audience. This initiative encourages innovation, collaboration, and the sharing of resources, ultimately leading to advancements in technology and science that can benefit all of humanity. By promoting inclusivity in space activities, we can inspire future generations and foster a sense of unity in our quest to explore the cosmos.",
        "SDGs": "",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "ASAT",
        "Core Values": "Collaboration, Impact, Innovation, Responsibility, Integrity",
        "Organisations": "Secure World Foundation",
        "How We Support It": "We support ASAT by providing resources for research, facilitating collaboration among teams, and ensuring access to necessary tools and technology. Additionally, we prioritize training and development to enhance skills related to ASAT initiatives.",
        "Why We Support It": "We support ASAT because it fosters innovation, encourages collaboration, and drives the advancement of technology that can benefit society. By investing in ASAT initiatives, we aim to promote sustainable practices and ensure a brighter future for all.",
        "SDGs": "SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21)",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "BCorp",
        "Core Values": "Integrity, Impact, Responsibility",
        "Organisations": "B Corp UK",
        "How We Support It": "We support BCorp by promoting sustainable business practices, facilitating access to resources and networks, and providing guidance on meeting BCorp certification requirements. Our initiatives include workshops, mentorship programs, and collaborative projects that align with BCorp's mission to create a positive impact on society and the environment.",
        "Why We Support It": "We support BCorp because it emphasizes social and environmental responsibility, promoting a positive impact on society while maintaining high standards of accountability and transparency in business practices.",
        "SDGs": "",
        "Description": "Contact type is a pledge with a status of not started and lead status as a prospect.",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Better Business Act",
        "Core Values": "Responsibility, Impact, Continuous Improvement (https://www.notion.so/Continuous-Improvement-1d1d6625c67980ccb087ce9d21f124a7?pvs=21)",
        "Organisations": "Better Business Network (https://www.notion.so/Better-Business-Network-21bd6625c67981e797d2f31390be9111?pvs=21)",
        "How We Support It": "We support the Better Business Act by advocating for policies that ensure businesses prioritize social and environmental responsibilities alongside shareholder interests. We provide resources and guidance for companies to implement these changes effectively, helping them to align their operations with the core values of sustainability and stakeholder engagement. Additionally, we promote transparency through reporting standards that reflect the balance between people, planet, and profit.",
        "Why We Support It": "We support the Better Business Act because it prioritizes the alignment of shareholder interests with societal and environmental concerns. By empowering directors to consider the welfare of all stakeholders, the act promotes sustainable business practices that benefit not only shareholders but also the community and the planet. This holistic approach encourages businesses to operate responsibly, fostering a culture of accountability and transparency that can lead to long-term success and positive impact.",
        "SDGs": "SDG 08 - Decent Work and Economic Growth (https://www.notion.so/SDG-08-Decent-Work-and-Economic-Growth-8f9f9442810b42ce90273bebe3da1486?pvs=21)",
        "Description": "Shareholder interests must align with societal and environmental concerns, empowering directors to prioritize all stakeholders. This principle applies to all businesses, requiring reporting on the balance of people, planet, and profit.",
        "Committed to": "Aligned Interests (https://www.notion.so/Aligned-Interests-1ccd6625c679804f842de214a83904c9?pvs=21), Empowering directors (https://www.notion.so/Empowering-directors-1ccd6625c67980e88329c0ff800f1aff?pvs=21), Default change (https://www.notion.so/Default-change-1ccd6625c67980888b26e678229dc109?pvs=21), Reflected in reporting (https://www.notion.so/Reflected-in-reporting-1ccd6625c679803c95b9f28b32677ea2?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Business Declares",
        "Core Values": "Integrity, Responsibility",
        "Organisations": "",
        "How We Support It": "We support it by aligning our business strategies with the Sustainable Development Goals (SDGs), actively engaging stakeholders, and integrating our core values into our operations to foster sustainable practices.",
        "Why We Support It": "We support the declaration of business initiatives because they align with our commitment to sustainable development goals (SDGs) and reflect our core values. By pledging to these initiatives, we contribute to positive social and environmental impacts, ensuring that our business practices are responsible and beneficial for both our community and the planet.",
        "SDGs": "SDG 08 - Decent Work and Economic Growth (https://www.notion.so/SDG-08-Decent-Work-and-Economic-Growth-8f9f9442810b42ce90273bebe3da1486?pvs=21), SDG 13 - Climate Action (https://www.notion.so/SDG-13-Climate-Action-cc070ddaf49442a78210e3a19895e558?pvs=21)",
        "Description": "Contact type is a pledge, currently on hold, with the lead status marked as prospect.",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Clean Creatives",
        "Core Values": "Responsibility, Collaboration, Integrity, Continuous Improvement (https://www.notion.so/Continuous-Improvement-1d1d6625c67980ccb087ce9d21f124a7?pvs=21), Innovation, Impact",
        "Organisations": "Clean Creatives (https://www.notion.so/Clean-Creatives-45d144a150014d41ab316a6f879f3829?pvs=21)",
        "How We Support It": "We support Clean Creatives by promoting their mission to encourage advertising agencies and brands to adopt environmentally responsible practices. This includes advocating for transparency in communications and supporting initiatives that reduce the carbon footprint of marketing activities.",
        "Why We Support It": "We support Clean Creatives because it advocates for a sustainable and ethical advertising industry. By promoting transparency and accountability, Clean Creatives encourages companies to align their marketing practices with environmentally friendly and socially responsible values. This initiative helps drive positive change within the industry, ensuring that creative professionals can contribute to projects that reflect their principles and protect the planet.",
        "SDGs": "SDG 07 - Affordable and Clean Energy (https://www.notion.so/SDG-07-Affordable-and-Clean-Energy-dbd5f73456e14897b180510f9512babb?pvs=21)",
        "Description": "No content",
        "Committed to": "I will decline any future contracts with fossil fuel companies, trade associations, or front groups (https://www.notion.so/I-will-decline-any-future-contracts-with-fossil-fuel-companies-trade-associations-or-front-groups-1cdd6625c67980609a71c971c0614796?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Climate Action",
        "Core Values": "",
        "Organisations": "Climate Action (https://www.notion.so/Climate-Action-21cd6625c67981179664f3728e0f57f8?pvs=21)",
        "How We Support It": "We support climate action by promoting sustainable practices, advocating for renewable energy sources, and engaging in community initiatives that raise awareness about environmental issues. Our commitment includes reducing carbon footprints, supporting legislation for climate protection, and collaborating with organizations dedicated to environmental conservation.",
        "Why We Support It": "We support climate action because it is essential for preserving our planet for future generations. Addressing climate change helps protect ecosystems, ensures sustainable resources, and promotes public health. By taking proactive measures, we can mitigate the impacts of global warming, foster economic growth through green technologies, and create a more equitable society. Supporting climate action is not just an environmental imperative; it is a moral responsibility to safeguard the Earth and enhance the quality of life for everyone.",
        "SDGs": "SDG 06 - Clean Water and Sanitation (https://www.notion.so/SDG-06-Clean-Water-and-Sanitation-48196b1c212e4ea1b0aecd40b6859db5?pvs=21)",
        "Description": "No content",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Creatives for Climate",
        "Core Values": "Impact, Collaboration, Responsibility",
        "Organisations": "",
        "How We Support It": "We support Creatives for Climate by promoting awareness of climate issues through creative projects, collaborating with artists and designers to inspire positive change, and engaging communities in sustainability initiatives.",
        "Why We Support It": "We support Creatives for Climate because it fosters innovative solutions and creative expressions that address climate change. By engaging artists and creatives, we can raise awareness, inspire action, and promote sustainable practices that contribute to a healthier planet for future generations.",
        "SDGs": "SDG 06 - Clean Water and Sanitation (https://www.notion.so/SDG-06-Clean-Water-and-Sanitation-48196b1c212e4ea1b0aecd40b6859db5?pvs=21), SDG 13 - Climate Action (https://www.notion.so/SDG-13-Climate-Action-cc070ddaf49442a78210e3a19895e558?pvs=21)",
        "Description": "No content",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Design Declares",
        "Core Values": "Responsibility, Collaboration, Impact",
        "Organisations": "",
        "How We Support It": "We support Design Declares by actively promoting sustainable design practices, engaging in community outreach to raise awareness about the Sustainable Development Goals (SDGs), and collaborating with other organizations to share resources and knowledge. Our commitment includes organizing workshops, participating in events that align with these values, and integrating sustainability into our design processes.",
        "Why We Support It": "We support Design Declares because it aligns with our commitment to sustainability and the Sustainable Development Goals (SDGs). By promoting responsible design practices, we can contribute to a better future and address pressing global challenges such as climate change, inequality, and resource depletion. Supporting initiatives like Design Declares helps foster a community of professionals dedicated to making a positive impact through their work.",
        "SDGs": "SDG 13 - Climate Action (https://www.notion.so/SDG-13-Climate-Action-cc070ddaf49442a78210e3a19895e558?pvs=21), SDG 04 - Quality Education (https://www.notion.so/SDG-04-Quality-Education-664fd4912f944287bc61077f794f8817?pvs=21), SDG 16 - Peace, Justice and Strong Institutions (https://www.notion.so/SDG-16-Peace-Justice-and-Strong-Institutions-24522da63344404ebf463878a7ec4e0f?pvs=21), SDG 17 - Partnerships for the Goals (https://www.notion.so/SDG-17-Partnerships-for-the-Goals-1ebc9e2a75f94c97a28420419d084104?pvs=21)",
        "Description": "Design Declares is committed to the Sustainable Development Goals (SDGs) and is currently active with a published status. More information can be found at their website.",
        "Committed to": "Amplify Voices for Change (https://www.notion.so/Amplify-Voices-for-Change-1ccd6625c679806fa11ceb65b42fd625?pvs=21), Design for Justice (https://www.notion.so/Design-for-Justice-1ccd6625c679803785e2dcf7f9bd7a0b?pvs=21), Educate, Accelerate (https://www.notion.so/Educate-Accelerate-1ccd6625c679804ab477f113d205940b?pvs=21), Redefine ‘Good’ (https://www.notion.so/Redefine-Good-1ccd6625c679807f85f8c6b1ff45b148?pvs=21), Measure What We Make (https://www.notion.so/Measure-What-We-Make-1ccd6625c679800ba964fbef71edddbc?pvs=21), Bring Clients with Us (https://www.notion.so/Bring-Clients-with-Us-1ccd6625c67980959a5cd0df17681ffa?pvs=21), Start the Journey (https://www.notion.so/Start-the-Journey-1ccd6625c67980c9a508e786c4764d60?pvs=21), Sound the Alarm (https://www.notion.so/Sound-the-Alarm-1ccd6625c6798008ac9dc6bdf7fe0121?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Disability Confident",
        "Core Values": "Continuous Improvement (https://www.notion.so/Continuous-Improvement-1d1d6625c67980ccb087ce9d21f124a7?pvs=21), Impact, Collaboration",
        "Organisations": "Department for Work and Pensions (https://www.notion.so/Department-for-Work-and-Pensions-1d6d6625c67981fe96cfecfdff1df555?pvs=21)",
        "How We Support It": "We support the Disability Confident initiative by promoting inclusivity and ensuring that our recruitment processes are accessible to all individuals, regardless of their disabilities. We provide training for staff on disability awareness, make necessary accommodations for employees, and actively seek to engage with the disabled community to understand their needs and challenges.",
        "Why We Support It": "We support the Disability Confident initiative because it promotes inclusivity and equality in the workplace. By fostering a culture that values and supports individuals with disabilities, we can enhance diversity, improve employee morale, and contribute to a more equitable society. Additionally, supporting this initiative aligns with our commitment to creating an environment where everyone has the opportunity to thrive and succeed.",
        "SDGs": "SDG 10 - Reduced Inequality (https://www.notion.so/SDG-10-Reduced-Inequality-12018ab7700242c3aadf3ea46617a79a?pvs=21), SDG 03 - Good Health and Well-being (https://www.notion.so/SDG-03-Good-Health-and-Well-being-1588cfac47c349b3980ff73dfdb28752?pvs=21)",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "LEAD statement",
        "Core Values": "Collaboration, Responsibility, Impact",
        "Organisations": "",
        "How We Support It": "We support the LEAD statement by embodying our core values and making a commitment to our stakeholders and community. Although specific core values and commitments are not listed in the document, we ensure that our actions align with our principles to foster a positive environment. We strive to promote collaboration, accountability, and respect in all our endeavors, reinforcing our dedication to our mission and vision.",
        "Why We Support It": "We support the LEAD statement because it embodies our core values and commitment to fostering a culture of excellence, integrity, and collaboration. By adhering to these principles, we aim to create a positive impact within our organization and the community, ensuring that our actions align with our mission and vision.",
        "SDGs": "SDG 16 - Peace, Justice and Strong Institutions",
        "Description": "No content",
        "Committed to": "Leave obstructing trade associations; Elevate climate policy as a company priority (https://www.notion.so/Elevate-climate-policy-as-a-company-priority-1ccd6625c679801b866bef8676f44343?pvs=21), Advocate publicly for effective binding climate policies (https://www.notion.so/Advocate-publicly-for-effective-binding-climate-policies-1ccd6625c67980b0ac24cda2640d64d2?pvs=21), Demonstrate real commitment to the collective action needed to achieve the just and equitable transition from fossil fuels agreed on at COP28. (https://www.notion.so/Demonstrate-real-commitment-to-the-collective-action-needed-to-achieve-the-just-and-equitable-transi-1ccd6625c67980b799f6d204ee63ea69?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Make Pledge - edie",
        "Core Values": "",
        "Organisations": "",
        "How We Support It": "To support your sustainable future initiatives, we encourage you to participate in the \"Mission Possible\" by submitting your own Mission Possible Pledge through the provided form. This allows your organization to publicly commit to sustainability goals while sharing your targeted pledge details, expected benefits, and contact information with the edie editorial team for further engagement.",
        "Why We Support It": "We support the \"Make Pledge\" initiative because it encourages businesses to actively participate in creating a sustainable future. By submitting a Mission Possible Pledge, organizations can clearly outline their commitment to sustainability and the positive impacts they aim to achieve. This collective effort not only raises awareness but also fosters accountability, collaboration, and innovation within industries, ultimately contributing to a healthier planet for future generations.",
        "SDGs": "",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Net Zero Carbon Events",
        "Core Values": "Integrity, Responsibility",
        "Organisations": "Net Zero Carbon Events",
        "How We Support It": "We support Net Zero Carbon Events by promoting sustainable practices, reducing carbon footprints, and encouraging the use of renewable resources in event planning and execution. Our initiatives include offering resources for carbon offsetting, educating stakeholders on sustainability, and collaborating with partners who share a commitment to environmental responsibility.",
        "Why We Support It": "We support Net Zero Carbon Events because they align with our commitment to sustainability and environmental responsibility. By reducing carbon emissions and promoting eco-friendly practices, we contribute to the global efforts in combating climate change and ensuring a healthier planet for future generations.",
        "SDGs": "SDG 15 - Life on Land, SDG 13 - Climate Action",
        "Description": "No content",
        "Committed to": "Collaborate with partners, suppliers and customers to drive change across the value chain, Measure and track our Scope 1, 2 and 3 GHG emissions according to industry best practice (https://www.notion.so/Measure-and-track-our-Scope-1-2-and-3-GHG-emissions-according-to-industry-best-practice-1ccd6625c6798065a6ffcf8312956504?pvs=21), Report on our progress at least every two years, Within 1.5 years after signing the pledge, publish the organisation's pathway to achieve net zero by 2050 at the latest, with an interim target in line with the Paris Agreement’s requirement to reduce global GHG emissions by 50% by 2030 (https://www.notion.so/Within-1-5-years-after-signing-the-pledge-publish-the-organisation-s-pathway-to-achieve-net-zero-by-1ccd6625c679809e982ec953c34aecd2?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Plant Based Treaty",
        "Core Values": "Impact, Responsibility",
        "Organisations": "Plant Based Treaty",
        "How We Support It": "We support the Plant Based Treaty by advocating for local, national, and global policies that prioritize plant-based food systems, raising awareness about the environmental and health benefits of plant-based diets, and encouraging individuals, organizations, and governments to endorse the treaty's principles and proposals. By participating in campaigns, educating our communities, and promoting sustainable practices, we aim to contribute to the transition towards a healthier and more sustainable food system that combats climate change and protects ecosystems.",
        "Why We Support It": "We support the Plant Based Treaty because it aims to address climate change through sustainable food systems, focusing on promoting plant-based diets which can significantly reduce greenhouse gas emissions and protect ecosystems. By endorsing this initiative, we contribute to a global movement advocating for healthier food choices, environmental preservation, and the well-being of future generations. The treaty emphasizes collaboration among individuals, groups, and governments to create effective policies that prioritize food security and biodiversity while combating the detrimental impacts of animal agriculture.",
        "SDGs": "SDG 12 - Responsible Consumption and Production (https://www.notion.so/SDG-12-Responsible-Consumption-and-Production-a1af83b5e5b7482999be10084f61927c?pvs=21), SDG 02 - Zero Hunger (https://www.notion.so/SDG-02-Zero-Hunger-73f72acfb810479095df901de05a6ad0?pvs=21), SDG 15 - Life on Land (https://www.notion.so/SDG-15-Life-on-Land-627b495b0b67465491650342778133f6?pvs=21), SDG 14 - Life Below Water (https://www.notion.so/SDG-14-Life-Below-Water-1204897701a9442c9c1c96a5fd8ef271?pvs=21)",
        "Description": "We are a grassroots initiative creating bottom-up pressure for the negotiation of a global Plant Based Treaty as a companion to the UNFCCC Paris Agreement. Modeled on the Fossil Fuel Treaty, the Plant Based Treaty aims to put food systems at the forefront of combating the climate crisis to halt the widespread degradation of critical ecosystems caused by animal agriculture and to promote a shift towards healthier, sustainable plant-based diets.",
        "Committed to": "Eliminate the driving forces behind the problem (https://www.notion.so/Eliminate-the-driving-forces-behind-the-problem-1ccd6625c6798050aeb2dca2a4d94ecc?pvs=21), Stop the problem increasing (https://www.notion.so/Stop-the-problem-increasing-1ccd6625c6798074b4ccfed8c0f8b299?pvs=21), Actively healing the problem while building resilience and mitigating climate change (https://www.notion.so/Actively-healing-the-problem-while-building-resilience-and-mitigating-climate-change-1ccd6625c6798094b924f98c670a1ea9?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Pledge to Net Zero",
        "Core Values": "",
        "Organisations": "",
        "How We Support It": "We support the commitment to achieving Net Zero by implementing sustainable practices, investing in renewable energy, and promoting energy efficiency across all operations. Our initiatives include reducing carbon emissions, enhancing resource conservation, and collaborating with stakeholders to foster a shared responsibility towards a sustainable future.",
        "Why We Support It": "We support the pledge to net zero because it represents a commitment to sustainability and environmental responsibility. Achieving net zero emissions is crucial for combating climate change, protecting ecosystems, and ensuring a healthier planet for future generations. By taking this pledge, we contribute to a collective effort to reduce our carbon footprint and promote a sustainable future for all.",
        "SDGs": "",
        "Description": "",
        "Committed to": "Publicly report greenhouse gas emissions and progress against this target each year. (https://www.notion.so/Publicly-report-greenhouse-gas-emissions-and-progress-against-this-target-each-year-1e7d6625c679800a9027dc91574c4e9e?pvs=21), Set and commit to deliver greenhouse gas reductions in line with Science Based Targets’ 1.5°C climate change scenario. For those in the environmental consultancy sector it must cover buildings and travel as a minimum. (https://www.notion.so/Set-and-commit-to-deliver-greenhouse-gas-reductions-in-line-with-Science-Based-Targets-1-5-C-climat-1e7d6625c67980769bc1f704dadc2536?pvs=21), Publish one piece of research/thought-leadership each year on practical steps to delivering an economy in line with climate science and in support of net zero carbon. Alternatively, signatories may choose to provide mentoring and support for smaller signatory companies in setting targets, reporting and meeting the requirements of the pledge. (https://www.notion.so/Publish-one-piece-of-research-thought-leadership-each-year-on-practical-steps-to-delivering-an-econo-1e7d6625c6798009adfad031fbf2c90a?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Race to Zero",
        "Core Values": "Innovation, Impact",
        "Organisations": "Race to Zero (https://www.notion.so/Race-to-Zero-10ad6625c6798061900ae2dc2b6ab32c?pvs=21)",
        "How We Support It": "The \"Race to Zero\" initiative supports the transition to net-zero greenhouse gas emissions through a series of pledges and actions that organizations can take. These include committing to ambitious targets for reducing emissions, protecting nature, and ensuring that the transition is just and equitable. Participants are encouraged to create transition plans, immediately act on their commitments, publish progress reports, and advocate for policies that align with the goal of limiting global warming to 1.5°C. The initiative emphasizes collaboration and accountability, urging organizations to empower stakeholders and contribute to global efforts beyond their immediate operations.",
        "Why We Support It": "We support the Race to Zero initiative because it aligns with our commitment to achieving net-zero greenhouse gas emissions by 2050, which is essential for limiting global warming to 1.5°C. This initiative emphasizes the importance of setting ambitious interim targets, protecting biodiversity, and ensuring a just transition for communities affected by climate change. By participating, we can contribute to significant emissions reductions, promote sustainable practices, and empower stakeholders in our ecosystem, thereby fostering a collective effort towards a more sustainable and equitable future.",
        "SDGs": "SDG 12 - Responsible Consumption and Production (https://www.notion.so/SDG-12-Responsible-Consumption-and-Production-a1af83b5e5b7482999be10084f61927c?pvs=21), SDG 13 - Climate Action (https://www.notion.so/SDG-13-Climate-Action-cc070ddaf49442a78210e3a19895e558?pvs=21), SDG 11 - Sustainable Cities and Communities (https://www.notion.so/SDG-11-Sustainable-Cities-and-Communities-17fa5cdabac4430189085f5ccb443520?pvs=21), SDG 17 - Partnerships for the Goals (https://www.notion.so/SDG-17-Partnerships-for-the-Goals-1ebc9e2a75f94c97a28420419d084104?pvs=21), SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21), SDG 08 - Decent Work and Economic Growth (https://www.notion.so/SDG-08-Decent-Work-and-Economic-Growth-8f9f9442810b42ce90273bebe3da1486?pvs=21)",
        "Description": "No content",
        "Committed to": "Plan within 12 months of joining, publicly disclose a transition plan which sets out how your organisation will deliver your 2030 carbon targets (https://www.notion.so/Plan-within-12-months-of-joining-publicly-disclose-a-transition-plan-which-sets-out-how-your-org-1e7d6625c679800bac4bc71517241fdc?pvs=21), Process – you need to be taking fast action to meet your carbon targets (your targets should cover scopes 1, 2 and 3 emissions). (https://www.notion.so/Process-you-need-to-be-taking-fast-action-to-meet-your-carbon-targets-your-targets-should-cover-s-1e7d6625c6798072b73afd86b00afb78?pvs=21), Persuade – within 12 months of joining, align external policy and engagement including association membership to the goal of halving emissions by 2030 and net zero by 2050. This includes proactively supporting climate policies at the subnational and national level consistent with the Race to Zero criteria (https://www.notion.so/Persuade-within-12-months-of-joining-align-external-policy-and-engagement-including-association-m-1e7d6625c67980efbd81fd876ae50111?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "SDG18",
        "Core Values": "Collaboration, Responsibility, Impact",
        "Organisations": "Space Renaissance International (https://www.notion.so/Space-Renaissance-International-21cd6625c67981aba8cbe6f4f3f02124?pvs=21)",
        "How We Support It": "We support SDG18 by advocating for policies that promote the sustainable development of space communities. This includes engaging with stakeholders, conducting research on the implications of space colonization, and raising public awareness about the importance of expanding life into space to achieve the existing Sustainable Development Goals (SDGs) on Earth. Additionally, we collaborate with international space organizations to ensure that space exploration and development are conducted responsibly and sustainably.",
        "Why We Support It": "We support the Space 18th Sustainable Development Goal (SDG) because it represents a critical step towards ensuring the long-term sustainability of life on Earth and beyond. By advocating for the expansion of human presence into space, we can address pressing challenges such as resource scarcity, climate change, and the need for innovation in sustainability practices. This initiative aligns with our commitment to achieving the existing 17 SDGs and promotes a future where humanity can thrive in harmony with its environment, both on our planet and in outer space.",
        "SDGs": "Baseline (https://www.notion.so/Baseline-b8d6455fa2db4c52b62824a20810f517?pvs=21), SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21)",
        "Description": "Only by expanding the domain of life into space can we fulfill the 17 SDGs on Earth in the long term. Therefore, the Space Renaissance International and the National Space Society, in partnership with many other space organizations, urge UN COPUOS State Parties to develop and introduce a resolution for a Space 18th Sustainable Development Goal (SDG), calling for the expansion of community life into space to achieve universal and sustainable development for the whole humanity, life, and the life support environment, on Earth and beyond.”",
        "Committed to": "Supporting a resolution for a Space 18th Sustainable Development Goal (SDG), calling for the expansion of community life into space to achieve universal and sustainable development for the whole humanity, life, and the life support environment, on Earth and beyond (https://www.notion.so/Supporting-a-resolution-for-a-Space-18th-Sustainable-Development-Goal-SDG-calling-for-the-expansi-1cdd6625c67980ea8c53f317a6664760?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "SME Climate Hub",
        "Core Values": "Impact, Responsibility, Innovation",
        "Organisations": "SME Climate Hub (https://www.notion.so/SME-Climate-Hub-10ad6625c67980498e7fd38bad96f45b?pvs=21)",
        "How We Support It": "We support the SME Climate Hub by providing resources, tools, and guidance to help small and medium-sized enterprises (SMEs) transition towards sustainable practices. This includes access to climate action frameworks, networking opportunities with like-minded businesses, and educational materials to enhance their understanding of environmental responsibilities.",
        "Why We Support It": "We support the SME Climate Hub because it provides valuable resources and guidance for small and medium-sized enterprises (SMEs) to take actionable steps towards sustainability. By fostering a community of committed businesses, it helps drive collective action in combating climate change and promotes best practices for reducing carbon footprints.",
        "SDGs": "SDG 13 - Climate Action (https://www.notion.so/SDG-13-Climate-Action-cc070ddaf49442a78210e3a19895e558?pvs=21)",
        "Description": "No content",
        "Committed to": "Halve our greenhouse gas emissions before 2030 (https://www.notion.so/Halve-our-greenhouse-gas-emissions-before-2030-1cdd6625c6798031b1e1e82a3b618dbf?pvs=21), Achieve net zero emissions before 2050 (https://www.notion.so/Achieve-net-zero-emissions-before-2050-1cdd6625c679802fac36c88a77ec27f2?pvs=21), Disclose our progress on a yearly basis (https://www.notion.so/Disclose-our-progress-on-a-yearly-basis-1cdd6625c67980638956da88e17e6b40?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Space Safety Coalition",
        "Core Values": "Collaboration, Innovation, Responsibility",
        "Organisations": "Space Safety Coalition (https://www.notion.so/Space-Safety-Coalition-21cd6625c67981d49ab2dd978e5d361d?pvs=21)",
        "How We Support It": "We support the Space Safety Coalition by promoting collaboration among space agencies, sharing best practices for safety protocols, and advocating for comprehensive regulations that protect both space assets and the environment. Through workshops, research initiatives, and outreach programs, we aim to enhance awareness of space safety challenges and solutions within the global space community.",
        "Why We Support It": "We support the Space Safety Coalition because it aims to enhance the safety and sustainability of space operations. By fostering collaboration among various stakeholders, including governments, industry, and academia, the coalition seeks to address the growing challenges in space traffic management, debris mitigation, and overall space environment preservation. This initiative not only safeguards current space assets but also ensures a secure and accessible space environment for future generations.",
        "SDGs": "",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Statement for a Responsible Space Sector",
        "Core Values": "Responsibility, Collaboration, Impact",
        "Organisations": "ESA - European Space Agency (https://www.notion.so/ESA-European-Space-Agency-21ed6625c679801cb240e1b9ce47e308?pvs=21)",
        "How We Support It": "We support a responsible space sector by prioritizing sustainable practices, fostering international cooperation, and ensuring compliance with space law and regulations. Our commitment includes promoting transparency in operations and engaging with various stakeholders to address challenges in space exploration and utilization.",
        "Why We Support It": "We support the establishment of a responsible space sector because it ensures sustainable use of outer space, promotes international collaboration, and safeguards the rights of future generations to access and benefit from space resources. A responsible approach can help mitigate space debris issues, enhance safety during space operations, and protect the space environment for scientific exploration and commercial activities.",
        "SDGs": "",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Sustainable Procurement Pledge (SPP)",
        "Core Values": "Responsibility, Collaboration, Impact",
        "Organisations": "",
        "How We Support It": "To support the Sustainable Procurement Pledge (SPP), we commit to fostering responsible, inclusive, and cooperative procurement behaviors in our day-to-day business conduct. We focus on standing up for people and the planet by addressing environmental and social challenges, promoting ethical practices, and eliminating exploitation and injustice in supply chains. We encourage collaboration, personal growth, knowledge sharing, and leaving a positive legacy. By signing the pledge, we join a community dedicated to driving meaningful change.",
        "Why We Support It": "We support the Sustainable Procurement Pledge (SPP) because it emphasizes the importance of responsible, inclusive, and cooperative procurement practices. By committing to values that prioritize the well-being of people and the planet, we can collectively address critical environmental and social challenges. The pledge encourages us to take personal responsibility, share knowledge, and create a positive legacy, ultimately driving meaningful change in supply chains and promoting ethical business conduct.",
        "SDGs": "",
        "Description": "",
        "Committed to": "#02: Together we will change the world. (https://www.notion.so/02-Together-we-will-change-the-world-1e7d6625c6798087b444e2fa819b2623?pvs=21), #01: Standing up for people and our planet. (https://www.notion.so/01-Standing-up-for-people-and-our-planet-1e7d6625c67980f488e0eb38f4bba131?pvs=21), #05: Leaving the right Legacy (https://www.notion.so/05-Leaving-the-right-Legacy-1e7d6625c67980778739e91161e749ef?pvs=21), #04: Sharing my knowledge and listening to others (https://www.notion.so/04-Sharing-my-knowledge-and-listening-to-others-1e7d6625c679809f96cfe52dce8a41ba?pvs=21), #03: Starting with myself (https://www.notion.so/03-Starting-with-myself-1e7d6625c67980ed9a28f00a167cc71c?pvs=21)",
        "CSR": "Ethical Responsibility (https://www.notion.so/Ethical-Responsibility-1d6d6625c6798008b5f4d089561122af?pvs=21)"
    },
    {
        "Name": "Sustainable Web Manifesto",
        "Core Values": "Responsibility, Collaboration, Innovation",
        "Organisations": "Sustainable Web Manifesto (https://www.notion.so/Sustainable-Web-Manifesto-10ad6625c6798004904cefbe5eac7dcd?pvs=21)",
        "How We Support It": "We support the Sustainable Web Manifesto by advocating for practices that prioritize sustainability in web development. This includes using energy-efficient hosting, optimizing website performance to reduce carbon footprints, and promoting transparency in our processes. Additionally, we commit to continuous learning and improvement in sustainable web practices, collaborating with others in the industry to create a positive impact on the environment.",
        "Why We Support It": "We support the Sustainable Web Manifesto because it promotes environmentally responsible web practices that aim to reduce the carbon footprint of online activities. By adhering to its principles, we can contribute to a more sustainable future, ensuring that digital solutions are not only innovative but also mindful of their impact on the planet. Supporting this manifesto aligns with our commitment to sustainability and responsible design.",
        "SDGs": "SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21), SDG 12 - Responsible Consumption and Production (https://www.notion.so/SDG-12-Responsible-Consumption-and-Production-a1af83b5e5b7482999be10084f61927c?pvs=21), SDG 07 - Affordable and Clean Energy (https://www.notion.so/SDG-07-Affordable-and-Clean-Energy-dbd5f73456e14897b180510f9512babb?pvs=21), SDG 11 - Sustainable Cities and Communities (https://www.notion.so/SDG-11-Sustainable-Cities-and-Communities-17fa5cdabac4430189085f5ccb443520?pvs=21)",
        "Description": "No content",
        "Committed to": "The services we provide and services we use will be powered by renewable energy. (https://www.notion.so/The-services-we-provide-and-services-we-use-will-be-powered-by-renewable-energy-1cdd6625c679801fa40dd695229f5f04?pvs=21), The products and services we provide will use the least amount of energy and material resources possible. (https://www.notion.so/The-products-and-services-we-provide-will-use-the-least-amount-of-energy-and-material-resources-poss-1cdd6625c67980528da9c1e6f614c843?pvs=21), The products and services we provide will be accessible, allow for the open exchange of information, and allow users to control their data. (https://www.notion.so/The-products-and-services-we-provide-will-be-accessible-allow-for-the-open-exchange-of-information--1cdd6625c67980d794bffa3cde43e46c?pvs=21), The products and services we provide will not mislead or exploit users in their design or content. (https://www.notion.so/The-products-and-services-we-provide-will-not-mislead-or-exploit-users-in-their-design-or-content-1cdd6625c679808cb0ebd906b866ee3f?pvs=21), The products and services we provide will support an economy that nourishes people and planet. (https://www.notion.so/The-products-and-services-we-provide-will-support-an-economy-that-nourishes-people-and-planet-1cdd6625c6798032a296e043c993f48d?pvs=21), The products and services we provide will function in the times and places where people need them most (https://www.notion.so/The-products-and-services-we-provide-will-function-in-the-times-and-places-where-people-need-them-mo-1cdd6625c67980e29c29e3e75891add5?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Tech Net Zero ",
        "Core Values": "Collaboration, Innovation",
        "Organisations": "techUK (https://www.notion.so/techUK-21cd6625c679814eae16d95b9977e7b1?pvs=21)",
        "How We Support It": "We support Tech Net Zero by providing resources and tools that help tech companies measure their carbon footprint, implement sustainable practices, and share best practices for reducing environmental impact. Additionally, we facilitate collaboration among members to promote innovative solutions and advocate for policies that support climate action.",
        "Why We Support It": "We support Tech Net Zero because it brings together tech companies to collaboratively address the climate crisis. By uniting resources, knowledge, and innovations, we can accelerate our efforts towards achieving net zero emissions. This initiative not only promotes sustainability in the tech industry but also sets a precedent for other sectors to follow, demonstrating the power of collective action in tackling global challenges.",
        "SDGs": "SDG 17 - Partnerships for the Goals (https://www.notion.so/SDG-17-Partnerships-for-the-Goals-1ebc9e2a75f94c97a28420419d084104?pvs=21), SDG 13 - Climate Action (https://www.notion.so/SDG-13-Climate-Action-cc070ddaf49442a78210e3a19895e558?pvs=21), SDG 11 - Sustainable Cities and Communities (https://www.notion.so/SDG-11-Sustainable-Cities-and-Communities-17fa5cdabac4430189085f5ccb443520?pvs=21), SDG 08 - Decent Work and Economic Growth (https://www.notion.so/SDG-08-Decent-Work-and-Economic-Growth-8f9f9442810b42ce90273bebe3da1486?pvs=21), SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21)",
        "Description": "The climate action group for tech companies of all sizes committed to fighting the climate crisis. We believe that by joining forces, we can make faster progress to net zero.",
        "Committed to": "Annually measure and publish their total greenhouse gas emissions. (https://www.notion.so/Annually-measure-and-publish-their-total-greenhouse-gas-emissions-1cdd6625c67980e99af0c070e2a46b3d?pvs=21), Publicly publish a net zero plan within 12 months of joining. (https://www.notion.so/Publicly-publish-a-net-zero-plan-within-12-months-of-joining-1cdd6625c6798055ab3dcff525cc8d3d?pvs=21), Appoint a member of their executive team to be responsible and accountable for their net zero target. (https://www.notion.so/Appoint-a-member-of-their-executive-team-to-be-responsible-and-accountable-for-their-net-zero-target-1cdd6625c67980868bd6c70af7bb98e5?pvs=21), Publicly their communicate climate commitments and progress to net zero. (https://www.notion.so/Publicly-their-communicate-climate-commitments-and-progress-to-net-zero-1cdd6625c67980258361d2244c24872a?pvs=21), Align their policies and partnerships to their net zero goals. (https://www.notion.so/Align-their-policies-and-partnerships-to-their-net-zero-goals-1cdd6625c67980db980ee4100706ddd6?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "Tech Talent Charter",
        "Core Values": "Collaboration, Continuous Improvement (https://www.notion.so/Continuous-Improvement-1d1d6625c67980ccb087ce9d21f124a7?pvs=21)",
        "Organisations": "techUK (https://www.notion.so/techUK-21cd6625c679814eae16d95b9977e7b1?pvs=21)",
        "How We Support It": "We support the Tech Talent Charter by actively promoting diversity and inclusion within the tech industry. This includes initiatives such as partnering with educational institutions, providing mentorship programs, and hosting workshops to empower underrepresented groups in technology.",
        "Why We Support It": "We support the Tech Talent Charter because it fosters diversity and inclusion within the tech industry. By collaborating with organizations committed to increasing representation and supporting underrepresented groups, we can create a more equitable workforce that drives innovation and reflects the diverse communities we serve.",
        "SDGs": "SDG 05 - Gender Equality (https://www.notion.so/SDG-05-Gender-Equality-7b20a2232f1040e683fd5f0b8d19548c?pvs=21), SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21)",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "The Ethical Move",
        "Core Values": "Integrity, Responsibility",
        "Organisations": "The Ethical Move (https://www.notion.so/The-Ethical-Move-21bd6625c6798192bf30e6e5d9ddd3ce?pvs=21)",
        "How We Support It": "We support the Ethical Move by promoting sustainable practices, encouraging transparency in business operations, and fostering collaborations that align with the Sustainable Development Goals (SDGs). Through our initiatives, we engage communities and organizations to adopt ethical frameworks that prioritize environmental and social responsibility.",
        "Why We Support It": "We support The Ethical Move because it promotes transparency and accountability in the design and development of products and services. By aligning with the Sustainable Development Goals (SDGs) and core values that prioritize ethical considerations, we can contribute to a more sustainable and equitable future. Supporting this initiative encourages responsible practices and inspires others in the industry to adopt similar commitments.",
        "SDGs": "SDG 17 - Partnerships for the Goals (https://www.notion.so/SDG-17-Partnerships-for-the-Goals-1ebc9e2a75f94c97a28420419d084104?pvs=21), SDG 12 - Responsible Consumption and Production (https://www.notion.so/SDG-12-Responsible-Consumption-and-Production-a1af83b5e5b7482999be10084f61927c?pvs=21), SDG 09 - Industry, Innovation and Infrastructure (https://www.notion.so/SDG-09-Industry-Innovation-and-Infrastructure-f26fae29951e4bb4994f7ea3a0fd0917?pvs=21), SDG 06 - Clean Water and Sanitation (https://www.notion.so/SDG-06-Clean-Water-and-Sanitation-48196b1c212e4ea1b0aecd40b6859db5?pvs=21)",
        "Description": "No content",
        "Committed to": "We put the person before the sale., We communicate inclusively, truthfully, and clearly., We take responsibility for our part in changing the marketplace.",
        "CSR": ""
    },
    {
        "Name": "The Sustainable Creatives Charter",
        "Core Values": "Continuous Improvement, Collaboration, Innovation",
        "Organisations": "The Sustainable Creatives Charter",
        "How We Support It": "We support the Sustainable Creatives Charter by promoting sustainable practices within our projects, collaborating with like-minded individuals and organizations, and actively engaging in transparency and accountability regarding our sustainability goals. We encourage creativity that prioritizes environmental responsibility and community impact, ensuring that our actions align with the core values outlined in the charter.",
        "Why We Support It": "We support the Sustainable Creatives Charter because it promotes responsible and ethical practices within the creative industry. By committing to sustainability, we can make a positive impact on the environment and society. The charter encourages transparency, collaboration, and innovation, empowering creatives to lead by example and inspire others. Supporting this initiative aligns with our values and goals of fostering a more sustainable future for all.",
        "SDGs": "SDG 13 - Climate Action",
        "Description": "No content",
        "Committed to": "Create clean, Declare and share, Lead by example, Be human, Start now, be bold!",
        "CSR": ""
    },
    {
        "Name": "Unashamedly Ethical",
        "Core Values": "Integrity, Responsibility",
        "Organisations": "Unashamedly Ethical",
        "How We Support It": "We support the Unashamedly Ethical initiative by promoting ethical business practices, encouraging transparency, and fostering a culture of accountability within organizations. Our commitment includes raising awareness about the Sustainable Development Goals (SDGs) and aligning our core values with ethical standards to create a positive impact in the community.",
        "Why We Support It": "We support Unashamedly Ethical because it promotes integrity, accountability, and ethical behavior in both personal and professional spheres. By aligning with the Sustainable Development Goals (SDGs) and core values, we contribute to a more ethical society that prioritizes responsible actions and transparency.",
        "SDGs": "SDG 07 - Affordable and Clean Energy, SDG 16 - Peace, Justice and Strong Institutions",
        "Description": "No content",
        "Committed to": "To be honest and ethical in all our dealings., To provide efficient, economic and effective products and services in an impartial manner., to provide all stakeholders with timely, accessible and accurate information., To refuse to elicit, accept or pay any bribes and to encourage others to do the same., to negotiate all contracts with the utmost integrity., To pay taxes and to honour all our creditors., To pay reasonable salaries and wages.  (https://www.notion.so/to-pay-reasonable-salaries-and-wages-1cdd6625c6798091b6bce711265ad293?pvs=21),  to submit ourselves to just and ethical governing authorities.  (https://www.notion.so/to-submit-ourselves-to-just-and-ethical-governing-authorities-1cdd6625c67980b683d9e4d4b3d62617?pvs=21), to remember the poor by investing generously and sacrificially in the broader community.  (https://www.notion.so/to-remember-the-poor-by-investing-generously-and-sacrificially-in-the-broader-community-1cdd6625c67980809ee7c0cbbf3517aa?pvs=21), to collaborate with our peers to impact our community and nation. (https://www.notion.so/to-collaborate-with-our-peers-to-impact-our-community-and-nation-1cdd6625c679803abb0aff099a8ac39d?pvs=21)",
        "CSR": ""
    },
    {
        "Name": "We Declare a Climate Emergency",
        "Core Values": "Responsibility, Collaboration, Impact",
        "Organisations": "",
        "How We Support It": "We support the declaration of a climate emergency by actively promoting awareness, advocating for policy changes, and implementing sustainable practices in our operations. Our commitment includes reducing carbon emissions, investing in renewable energy, and engaging with communities to foster a collective response to the climate crisis. Together, we aim to inspire action and drive change towards a sustainable future.",
        "Why We Support It": "We support declaring a climate emergency because it emphasises the urgent need for immediate action to combat climate change. This declaration serves as a rallying cry for governments, organizations, and individuals to recognize the severity of the crisis and to implement the necessary measures to reduce carbon emissions, protect ecosystems, and ensure a sustainable future for generations to come. It aligns with our core values of responsibility towards the planet and prioritizing the health of our environment.",
        "SDGs": "",
        "Description": "No content",
        "Committed to": "",
        "CSR": ""
    },
    {
        "Name": "Zero Debris Charter",
        "Core Values": "Integrity, Responsibility",
        "Organisations": "ESA - European Space Agency",
        "How We Support It": "We support the Zero Debris Charter by implementing sustainable waste management practices, engaging in community education about litter reduction, and collaborating with local organizations to promote clean-up initiatives. Our commitment includes regular assessments of waste reduction efforts and encouraging volunteer participation in environmental conservation activities.",
        "Why We Support It": "We support the Zero Debris Charter because it promotes sustainable practices and aims to reduce waste in our environments. By adopting this charter, we can contribute to cleaner oceans, protect wildlife, and ensure a healthier planet for future generations. Additionally, it encourages collaboration among various stakeholders to implement effective waste management solutions and create a positive impact on our communities.",
        "SDGs": "",
        "Description": "",
        "Committed to": "",
        "CSR": ""
    }
]